[
  {
    "link": "https://www.digitaltrends.com/users/zislam/",
    "name": "Zak Islam",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Zak Islam was a freelance writer at Digital Trends covering the latest news in the technology world, particularly the computing field. A fan of anything pertaining to tech from the latest gadgets to the newest graphics cards and CPUs, Zak has also written for Tom\u0027s Hardware."
  },
  {
    "link": "https://www.digitaltrends.com/users/cristinamariealexandergmail-com/",
    "name": "Cristina Alexander",
    "workingAs": "Gaming/Mobile Writer",
    "detail": "Cristina Alexander has been writing since 2014, from opining about pop culture on her personal blog in college to reporting on video games, entertainment, Internet culture, and more recently, mobile technology as a freelance journalist. Her work has appeared on TheGamer, Gamepur, SlashGear, Giant Freakin\u0027 Robot, Twinfinite, KeenGamer, and Mega Visions. Cristina used to be an Android girl, now she\u0027s an Apple woman with no possible plans to turn back anytime soon. She resides in sunny South Florida."
  },
  {
    "link": "https://www.digitaltrends.com/users/mwhite/",
    "name": "Monica J. White",
    "workingAs": "Computing Writer",
    "detail": "Monica is a UK-based freelance writer and self-proclaimed geek. A firm believer in the \"PC building is just like expensive Legos\" philosophy, Monica loves to play around with different builds - if not in reality, then at least on one of her several wishlists. If she\u0027s not currently neck-deep in Google Docs or elbow-deep in her PC case, she\u0027s most likely spending the day gaming or hanging out with her dog."
  },
  {
    "link": "https://www.digitaltrends.com/users/mgebel/",
    "name": "Meira Gebel",
    "workingAs": "",
    "detail": "Meira Gebel is a freelance reporter based in Portland. She writes about tech, social media, and internet culture for Digital Trends. Her work has been featured in Business Insider, USA Today, Willamette Week, Detroit Free Press, San Francisco Business Times, and more. Got a tip? Or just want to chat about the Kardashians? Twitter DMs are always open."
  },
  {
    "link": "https://www.digitaltrends.com/users/caleb-clark/",
    "name": "Caleb Clark",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Caleb Clark is a full-time writer that primarily covers consumer tech and gaming. He also writes frequently on Medium about books and movies. He spends his free time playing Warhammer, raising nerdy children, and writing his first novel."
  },
  {
    "link": "https://www.digitaltrends.com/users/sagarwal/",
    "name": "Shubham Agarwal",
    "workingAs": "Journalist",
    "detail": "Shubham Agarwal is a freelance technology journalist from Ahmedabad, India. His work has previously appeared in Firstpost, HuffPost India, and Tomsguide."
  },
  {
    "link": "https://www.digitaltrends.com/users/emorrow/",
    "name": "Emily Morrow",
    "workingAs": "",
    "detail": "Emily Morrow is a games journalist and narrative designer who has written for a variety of online publications. If she’s not playing games, writing about games, or thinking about games, she’s probably asleep. She also likes chasing thunderstorms, reading, and petting all the cats. You can read more of her ramblings on Twitter @thepokeflute."
  },
  {
    "link": "https://www.digitaltrends.com/users/bkenney/",
    "name": "Briley Kenney",
    "workingAs": "Senior SEO Copywriter",
    "detail": "Briley has been writing about consumer electronics and technology for over a decade. When he\u0027s not writing about deals for Digital Trends, he\u0027s writing how-to content, and guides for Lifewire, Ideaing, and several other online publications. He\u0027s also a ghostwriter for more than one confidential SEO marketing agency. In his downtime, he\u0027s either spending time with his family, playing games, or enjoying a good ol\u0027 stogie."
  },
  {
    "link": "https://www.digitaltrends.com/users/giovannicolantonio/",
    "name": "Giovanni Colantonio",
    "workingAs": "Section Editor, Gaming",
    "detail": "Giovanni is a writer and video producer focusing on happenings in the video game industry. He has contributed stories to Inverse, Fanbyte, The Inventory, and more. He was previously a segment producer on Polygon\u0027s daily gaming show Speedrun and he currently hosts the Left Trigger Right Trigger podcast. Four Tetris 99 wins, and counting."
  },
  {
    "link": "https://www.digitaltrends.com/users/alexblake/",
    "name": "Alex Blake",
    "workingAs": "Computing Writer",
    "detail": "In ancient times, people like Alex would have been shunned for their nerdy ways and strange opinions on cheese. Today, he fits right in at Digital Trends, where he writes about all things Apple, from the latest devices to ongoing developments and everything in between. He’s loved tech ever since he realized video games were about as fun as real people, but easier to manage and much cheaper."
  },
  {
    "link": "https://www.digitaltrends.com/users/mallison/",
    "name": "Michael Allison",
    "workingAs": "Mobile News Writer",
    "detail": "A UK-based tech journalist for Digital Trends, helping keep track and make sense of the fast-paced world of tech with a primary focus on mobile phones, tablets, and wearables."
  },
  {
    "link": "https://www.digitaltrends.com/users/dmatthews/",
    "name": "David Matthews",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "David is a freelance journalist based just outside of Washington D.C. specializing in consumer technology and gaming. He has over five years of experience with bylines in major publications such as Digital Trends, TechSpot, and IGN. Outside of writing, David enjoys playing FPS and action RPGs, reading, and spending time with family."
  },
  {
    "link": "https://www.digitaltrends.com/users/jacob-roach/",
    "name": "Jacob Roach",
    "workingAs": "Lead Reporter, PC Hardware",
    "detail": "Jacob Roach is the lead reporter for PC hardware at Digital Trends. In addition to covering the latest PC components, from graphics cards to processors to PC cases, Jacob also leads the ReSpec column and newsletter that covers the intersection of PC hardware and gaming. If it\u0027s something you can plug into a gaming PC, there\u0027s a good chance Jacob has used it."
  },
  {
    "link": "https://www.digitaltrends.com/users/cnguyen/",
    "name": "Chuong Nguyen",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Silicon Valley-based technology reporter and Giants baseball fan who splits his time between Northern California and Southern California. Chuong enjoys all things gadget-related and his passions include traveling, photography, gardening, ocean kayaking, and hiking. Be sure to reach out on Twitter if you\u0027re in the San Francisco Bay Area and have cool technology to pitch, have new music recommendations, or if you have any suggestions for cool restaurants or hiking spots!"
  },
  {
    "link": "https://www.digitaltrends.com/users/jonmartindale/",
    "name": "Jon Martindale",
    "workingAs": "Computing Coordinator",
    "detail": "Jon Martindale is the Evergreen Coordinator for Computing, overseeing a team of writers addressing all the latest how to guides, best-of lists, and explainers to help everyone understand the hottest new hardware and software in desktops, laptops, and on the web."
  },
  {
    "link": "https://www.digitaltrends.com/users/ldormehl/",
    "name": "Luke Dormehl",
    "workingAs": "Contributor",
    "detail": "I\u0027m a UK-based tech writer covering Cool Tech at Digital Trends. I\u0027ve also written for Fast Company, Wired, the Guardian, Politico and others. I\u0027m the author of Thinking Machines and The Formula: How Algorithms Solve All Our Problems... And Create More."
  },
  {
    "link": "https://www.digitaltrends.com/users/simon-chandler/",
    "name": "Simon Chandler",
    "workingAs": "Mobile Writer",
    "detail": "Simon Chandler is a journalist based in London, UK. He covers technology and finance, contributing to such titles as Digital Trends, Forbes, Business Insider, InsideBitcoins, Cryptonews.com, and CryptoVantage. He has also contributed to Wired, TechCrunch, TechRadar, the Daily Dot, the Verge, Cointelegraph, CCN.com, the New Internationalist, Bandcamp, the Sun, and numerous others."
  },
  {
    "link": "https://www.digitaltrends.com/users/abacchus/",
    "name": "Arif Bacchus",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Arif Bacchus is a native New Yorker and a fan of all things technology. Arif works as a freelance writer at Digital Trends and OnMSFT, covering Microsoft, Surface, Windows, macOS, and Chrome OS news and rumors. He also writes the occasional laptop review and how-to guide. Arif is a huge Microsoft fan and has as many Windows PCs as he has fingers. When not writing or playing on PCs, you can find him on Twitter where he\u0027s always making new friends and engaged with the tech community."
  },
  {
    "link": "https://www.digitaltrends.com/users/amatyus/",
    "name": "Allison Matyus",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Allison Matyus is a general news reporter at Digital Trends. She covers any and all tech news, including issues around social media and data privacy. Allison was previously a freelance journalist for the Chicago Tribune Media Group covering local news in Chicago’s South Suburbs. She’s also written for The Idea Forge, where she covered the city\u0027s tech industry and startup landscape. Allison spent nearly two years as a Senior Reporter at Chicago’s oldest neighborhood newspaper, The Hyde Park Herald, where she covered politics, education, real estate, retail, and development. Living in Chicago, Allison has her own personal wellness blog and loves to travel to national parks."
  },
  {
    "link": "https://www.digitaltrends.com/users/zjones/",
    "name": "Zoe Christen Jones",
    "workingAs": "",
    "detail": "Zoe Christen Jones is a breaking news reporter. She covers news, digital culture, tech, and more."
  },
  {
    "link": "https://www.digitaltrends.com/users/trevor_mogg/",
    "name": "Trevor Mogg",
    "workingAs": "Contributing Editor",
    "detail": "Not so many moons ago, Trevor moved from one tea-loving island nation that drives on the left (Britain) to another (Japan). As far as electronics are concerned, he\u0027s in the right place, with the East Asian country continuing to produce a plethora of gadgets and gizmos for tech addicts around the world. When not writing for Digital Trends, Trevor can be found out and about taking far too many photos, or in front of his computer trying to sort them all out."
  },
  {
    "link": "https://www.digitaltrends.com/users/hgrigonis/",
    "name": "Hillary K. Grigonis",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Hillary never planned on becoming a photographer—and then she was handed a camera at her first writing job and she\u0027s been writing with one hand and shooting with the other ever since. At Hillary K Photography, she works as a wedding and portrait photographer. When she\u0027s not writing or shooting, she\u0027s trying to keep up with two kids, collecting film cameras, unplugging outdoors, reading or traveling."
  },
  {
    "link": "https://www.digitaltrends.com/users/msampathkumar/",
    "name": "Mythili Sampathkumar",
    "workingAs": "",
    "detail": "Mythili is a freelance journalist based in New York. When not reporting about politics, foreign policy, entertainment, and climate change, she is reading during a subway delay and attempting to be artistic."
  },
  {
    "link": "https://www.digitaltrends.com/users/kparrish/",
    "name": "Kevin Parrish",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Kevin started taking PCs apart in the 90s when Quake was on the way and his PC lacked the required components. Since then, he’s loved all things PC-related and cool gadgets ranging from the New Nintendo 3DS to Android tablets. At Digital Trends, he\u0027s written everything about computers, from how-to content on Windows and Macs to reviews of the latest laptops from HP, Dell, Lenovo, and more. He began his online writing career cranking out news, reviews, and previews based on the Sega Dreamcast console."
  },
  {
    "link": "https://www.digitaltrends.com/users/simonhill/",
    "name": "Simon Hill",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Simon Hill is an experienced technology journalist and editor who loves all things tech. He is currently the Associate Mobile Editor at Digital Trends. He has spent more than a decade writing about smartphones, wearables, tablets, software, computing, videogames, and robots all over the internet for Tech Radar, Android Authority, USA Today, VentureBeat, Deal News, and many other places. His work has also appeared on Yahoo! Tech, CNN, Fox News, Lifehacker, and Christian Science Monitor. He also spent several years working in the games industry as a game designer and producer. He lives in Scotland with his wife and two kids."
  },
  {
    "link": "https://www.digitaltrends.com/users/gtorbet/",
    "name": "Georgina Torbet",
    "workingAs": "Space Writer",
    "detail": "Georgina is the Digital Trends space writer, covering human space exploration, planetary science, and cosmology. She specializes in current and future exploration of Mars. She has previously written about science, technology, and security topics for websites like SlashGear, Engadget, and Futurism. She has a master\u0027s degree in neuroscience and a PhD in psychology."
  },
  {
    "link": "https://www.digitaltrends.com/users/wnicol/",
    "name": "Will Nicol",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Will Nicol is a Senior Writer at Digital Trends. He covers a variety of subjects, particularly emerging technologies, movies and TV, and more. He has keen interest in technologies that can transform society, and also has hot takes about Game of Thrones. When not working, Will enjoys practicing guitar, learning Spanish, and spending too much money building Magic: The Gathering decks."
  },
  {
    "link": "https://www.digitaltrends.com/users/delooper/",
    "name": "Christian de Looper",
    "workingAs": "Contributor",
    "detail": "Christian’s interest in technology began as a child in Australia, when he stumbled upon a computer at a garage sale that he knew didn’t work, but he bought anyway. Now living in California, he covers the world of mobile technology for Digital Trends, from the latest Apple iPhone and iPad to the vast array of Android smartphones on the market -- and the various apps and services. Apart from writing about tech, Christian spends his time in the music studio as a producer."
  },
  {
    "link": "https://www.digitaltrends.com/users/mkatz/",
    "name": "Mathew Katz",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Mathew is a news editor at Digital Trends, specializing in covering all kinds of tech news — from video games to policy. He makes sure Digital Trends keeps you up-to-date with the latest developments on how tech affects your life and how government and businesses impact how you use technology."
  },
  {
    "link": "https://www.digitaltrends.com/users/eprice/",
    "name": "Emily Price",
    "workingAs": "",
    "detail": "Emily is a freelance writer based in San Francisco. Her book \"Productivity Hacks: 500+ Easy Ways to Accomplish More at Work--That Actually Work!\" was published in December 2018 by Simon and Schuster/Adams Media."
  },
  {
    "link": "https://www.digitaltrends.com/users/jterrasi/",
    "name": "Jonathan Terrasi",
    "workingAs": "",
    "detail": "Jonathan has studiously followed trends in technology, particularly in information security and digital privacy, since 2014 when he began teaching himself and developing proficiency in running Linux systems and deploying encryption."
  },
  {
    "link": "https://www.digitaltrends.com/users/twerkhoven/",
    "name": "Todd Werkhoven",
    "workingAs": "",
    "detail": "Todd Werkhoven\u0027s work can be read at numerous publications and he co-authored a personal finance book called \"Zombie Economics\" through Penguin Publishing. He has over 20 years of copywriting experience for industries ranging from natural foods products to high-end electronics and technology. Outside of writing, Todd works with children with special needs, and is usually podcasting for shows like \"Portland at the Movies\" and \"The Mark and Toddcast.\""
  },
  {
    "link": "https://www.digitaltrends.com/users/amamiit/",
    "name": "Aaron Mamiit",
    "workingAs": "Contributor",
    "detail": "Aaron received a NES and a copy of Super Mario Bros. for Christmas when he was 4 years old, and he has been fascinated with tech ever since. A gamer at heart, Aaron believes that while the tech industry is often dealing with side quests and boss fights, it always remains on track with the mission to save the world."
  },
  {
    "link": "https://www.digitaltrends.com/users/adellinger/",
    "name": "AJ Dellinger",
    "workingAs": "Contributor",
    "detail": "AJ Dellinger is a freelance reporter from Madison, Wisconsin with an affinity for all things tech. He has been published by Gizmodo, Newsweek, International Business Times, the Daily Dot, and many others."
  },
  {
    "link": "Not available",
    "name": "Not available",
    "workingAs": "Not available",
    "detail": "Not available"
  },
  {
    "link": "https://www.digitaltrends.com/users/ageorge/",
    "name": "Anita George",
    "workingAs": "Computing Writer",
    "detail": "Anita has been a technology reporter since 2013 and currently writes for the Computing section at Digital Trends. She began covering science and technology during an editorial internship at Paste Magazine. Anita has written a wide variety of features, reviews, how-tos and lists about the latest gadgets, apps and other technological innovations. In addition to her published work, Anita also developed technology-themed educational programming for her local community; which involved topics such as 3D printing and simple robotics (specifically Lego WeDos and Mindstorms)."
  },
  {
    "link": "https://www.digitaltrends.com/users/bbarbee/",
    "name": "Brie Barbee",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Brie is a writer from Portland, Oregon. She received a bachelor\u0027s degree from Portland State University in 2016, where she studied English and German. When she isn\u0027t writing about tech or pop culture, Brie enjoys reading, writing short stories, watching TV, crocheting, and snuggling with her two cats, Luna and Tally."
  },
  {
    "link": "https://www.digitaltrends.com/users/dtstaff/",
    "name": "Digital Trends Staff",
    "workingAs": "",
    "detail": "Digital Trends has a simple mission: to help readers easily understand how tech affects the way they live. We are your authoritative guide to the world around us. We love, live and breathe tech so that we can explain it to you simply and clearly."
  },
  {
    "link": "https://www.digitaltrends.com/users/simoncohen/",
    "name": "Simon Cohen",
    "workingAs": "Contributing Editor, A/V",
    "detail": "Simon Cohen covers a variety of consumer technologies, but has a special interest in audio and video products, like spatial audio, whole-home music systems, wireless earbuds and headphones, 4K HDR TVs, and soundbars. He has written for Ozy.com, Mobilesyrup, Driving.ca, and VentureBeat, and appeared as a guest tech expert on international TV and radio programs, including BBC Radio, CTV News Channel, and CBC Radio. He is currently a full-time contributor to Digital Trends\u0027 Audio/Video section."
  },
  {
    "link": "https://www.digitaltrends.com/users/kcoomes/",
    "name": "Kailla Coomes",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Kailla is a staff writer from Portland, Ore. She studied Journalism at the University of Oregon and graduated in 2014. In her free time, Kailla watches reruns of \u0027The Office,\u0027 attempts to teach herself bass guitar, and listens to true-crime podcasts. When she is not writing about tech, Kailla likes to write short stories and poetry."
  },
  {
    "link": "https://www.digitaltrends.com/users/andy_boxall/",
    "name": "Andy Boxall",
    "workingAs": "Senior Mobile Writer",
    "detail": "Andy is a Senior Writer at Digital Trends, where he concentrates on mobile technology, a subject he has written about for almost a decade. During that time he has seen the evolution from 2G to 5G, reviewed dozens of smartphones, worn dozens of smartwatches (not at the same time), and visited many manufacturers and events all over the world. A multi-year veteran of Mobile World Congress, CES, IFA, and Baselworld trade shows, Andy always has a strong opinion on the mobile industry, and is excited about its future."
  },
  {
    "link": "https://www.digitaltrends.com/users/tkoch/",
    "name": "Tamir Koch",
    "workingAs": "",
    "detail": "Tamir Koch is President of eMusic, a digital entertainment pioneer and 20-year champion of independent artists and labels. Today he\u0027s passionate about the power of Blockchain to fix what\u0027s broken in the music industry."
  },
  {
    "link": "https://www.digitaltrends.com/users/ebrackett/",
    "name": "Eric Brackett",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Not available"
  },
  {
    "link": "https://www.digitaltrends.com/users/ggurwin/",
    "name": "Gabe Gurwin",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Gabe Gurwin has been playing games since 1997, beginning with the N64 and the Super Nintendo. He began his journalism career back in 2010 while still in high school, and subsequently graduated summa cum laude from Ohio University\u0027s E.W. Scripps School of Journalism in 2016."
  },
  {
    "link": "https://www.digitaltrends.com/users/gburgett/",
    "name": "Gannon Burgett",
    "workingAs": "Editor",
    "detail": "Not available"
  },
  {
    "link": "https://www.digitaltrends.com/users/patrickdaniels/",
    "name": "Forrest Daniels",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "As a young woman Forrest discovered her passion for technology and art through her family\u0027s monstrous collection of goofy 90s sci-fi movies. As she grew, so did the technology around her and the desire to know and use it. Today she spends her time dabbling in software development and 3D printing."
  },
  {
    "link": "https://www.digitaltrends.com/users/stephen_edelstein/",
    "name": "Stephen Edelstein",
    "workingAs": "Contributing Editor",
    "detail": "Stephen is a freelance automotive journalist covering all things cars. He likes anything with four wheels, from classic cars to modern Tesla electric cars, and everything in between. Besides contributing to the cars section at Digital Trends, Stephen has bylines at Green Car Reports, Motor Authority, and CarGurus."
  },
  {
    "link": "https://www.digitaltrends.com/users/llarsen/",
    "name": "Luke Larsen",
    "workingAs": "Senior Editor, Computing",
    "detail": "Luke Larsen is a Senior Editor at Digital Trends and manages all content covering laptops, monitors, PC hardware, and everything else that plugs into a computer. Luke joined Digital Trends in 2017 as a native Portlander, happy to join a media company that called his city home. His obsession with technology is in observing the ebb and flow of how technological advancement and product design intersects with our day-to-day experience of it. From digging into the minute details to stepping back and seeing the wider trends, Luke revels in telling stories with tech."
  },
  {
    "link": "https://www.digitaltrends.com/users/edoswald/",
    "name": "Ed Oswald",
    "workingAs": "Contributor",
    "detail": "For fifteen years, Ed has written about the latest and greatest in gadgets and technology trends. At Digital Trends, he\u0027s turned his focus to helping readers find the best deals on the web, as well as emerging tech and science news. His book, Weather Watch: An Introduction to America\u0027s Weather and Climate, is now available on Amazon, and runs two blogs on weather stations and smart home gadgets."
  },
  {
    "link": "https://www.digitaltrends.com/users/kraigbecker/",
    "name": "Kraig Becker",
    "workingAs": "Contributor",
    "detail": "Kraig Becker is a freelance outdoor writer who loves to hike, camp, mountain bike, trail run, paddle, or just about any other activity that gets him outside. An avid adventure traveler and self-confessed gadget-nerd, he believes that technology can play a crucial role in your enjoyment of the outdoors."
  },
  {
    "link": "https://www.digitaltrends.com/users/jwagner/",
    "name": "Jayce Wagner",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "A staff writer for the Computing section, Jayce covers a little bit of everything -- hardware, gaming, and occasionally VR."
  },
  {
    "link": "https://www.digitaltrends.com/users/rcavanaugh/",
    "name": "Rachel Cavanaugh",
    "workingAs": "Contributor",
    "detail": "Rachel discovered outdoor recreation in ’98 when she stumbled into a river town one summer and left a raft guide 3 months later. She worked at ski resorts and snowboard shops before launching her career as a journalist which has included writing for print newspapers, magazines and various online publications."
  },
  {
    "link": "https://www.digitaltrends.com/users/rglon/",
    "name": "Ronan Glon",
    "workingAs": "Contributor",
    "detail": "Ronan Glon is an American automotive and tech journalist based in southern France. As a long-time contributor to Digital Trends, his job is to bridge the gap between cars and tech, while helping consumers and enthusiasts alike navigate these two increasingly intertwined worlds. He travels extensively and restlessly to get the inside scoop on horsepower, infotainment, or both."
  },
  {
    "link": "https://www.digitaltrends.com/users/drew_prindle/",
    "name": "Drew Prindle",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Drew Prindle is an award-winning writer, editor, and storyteller who currently serves as Senior Features Editor for Digital Trends. His work covers a broad range of topics, but generally leans toward science, emerging technology, and the future. He\u0027s also technically a cyborg, and has been living with microchips in his hands since 2016."
  },
  {
    "link": "https://www.digitaltrends.com/users/billroberson/",
    "name": "Bill Roberson",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "I focus on producing Digital Trends\u0027 \u0027DT Daily\u0027 video news program along with photographing items we get in for review. I also personally review various tech items - and the occasional motorcycle. Follow me on Twitter: @BillRobersonDT"
  },
  {
    "link": "https://www.digitaltrends.com/users/mattsmith/",
    "name": "Matthew S. Smith",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Matthew S. Smith is the former Lead Editor, Reviews at Digital Trends. He previously guided the Products Team, which dives deep into evaluating laptops, smartphones, televisions, headphones, and much more. In addition to more than 10 years of experience in tech journalism, Matt has appeared in hundreds of videos (both live and recorded) and has interviewed executives from numerous companies including AMD, IBM, and Intel."
  },
  {
    "link": "https://www.digitaltrends.com/users/bradjones/",
    "name": "Brad Jones",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Brad is an English-born writer currently splitting his time between Edinburgh and Pennsylvania. You can find him on Twitter under the handle @beardjones"
  },
  {
    "link": "https://www.digitaltrends.com/users/knelsonjr/",
    "name": "Keith Nelson Jr.",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Keith Nelson Jr is a music/tech journalist making big pictures by connecting dots. Born and raised in Brooklyn, NY he graduated from Syracuse University with a Bachelor\u0027s Degree in English \u0026 Textual Studies. Keith keeps a critical eye on all transgressions in the music technology field."
  },
  {
    "link": "https://www.digitaltrends.com/users/markcoppock/",
    "name": "Mark Coppock",
    "workingAs": "Computing Writer",
    "detail": "Mark has been a geek since MS-DOS gave way to Windows and the PalmPilot was a thing. He’s translated his love for technology into a marketing, consulting, and freelance writing career aimed at helping people use technology to enhance their lives. At Digital Trends, he reviews laptops and desktops, including the latest from HP, Dell, Lenovo, Apple, and more, and writes news and easy to understand how-to articles about the computing industry as a whole."
  },
  {
    "link": "https://www.digitaltrends.com/users/lucascoll/",
    "name": "Lucas Coll",
    "workingAs": "Deals and News Writer",
    "detail": "Lucas Coll has been a freelance writer for almost a decade and has penned articles on tech, video games, travel, cars, and men’s lifestyle topics. He’s held a special interest in computers and consumer technology ever since his mother brought home a Nintendo Entertainment System when he was four years old (a decision she regrets to this day), and he has written everything from news articles and deal roundups for laptops, Apple gadgets, smartphones, smartwatches, and pretty much anything else that uses electricity. When he’s not rounding up tech deals for Digital Trends or covering upcoming UFC fights for The Manual, Lucas can usually be found in his Hobbit hole reading, gaming, smoking a pipe, and messing about with computers."
  },
  {
    "link": "https://www.digitaltrends.com/users/markaustin/",
    "name": "Mark Austin",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Mark’s first encounter with high-tech was a TRS-80. He spent 20 years working for Nintendo and Xbox as a writer and corporate shill. He sucks at shooters and much prefers playing relaxing city builders and management sims."
  },
  {
    "link": "https://www.digitaltrends.com/users/mjansen/",
    "name": "Mark Jansen",
    "workingAs": "Contributor",
    "detail": "Mark Jansen is an avid follower of everything that beeps, bloops, or makes pretty lights. He has a degree in Ancient \u0026 Medieval History, which obviously makes him a shoo-in to write about technology for a living. He currently contributes to the Mobile section on Digital Trends, with a particular emphasis and expertise on exploring the weirder side of smartphones, from tiny rugged phones to massive gaming phones. You\u0027ll most often find him seeking out leaks and rumors on upcoming devices, and playing with a variety of new apps for both Android and iOS."
  },
  {
    "link": "https://www.digitaltrends.com/users/dmathies/",
    "name": "Daven Mathies",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Daven is a contributing writer to the photography section. He has been with Digital Trends since 2016 and has been writing about photography and tech for over a decade. He originally began writing at a young age for no other reason than to teach himself how to type, later taking up photography to learn how cameras worked. His love for the tech eventually turned into a passion for the crafts facilitated by it, leading him to pursue a degree in film and video production. He now moonlights as a wedding and portrait photographer, and still yearns to be a better typist."
  },
  {
    "link": "https://www.digitaltrends.com/users/lchang/",
    "name": "Lulu Chang",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Fascinated by the effects of technology on human interaction, Lulu believes that if her parents can use your new app, service, or gadget, it\u0027s worth her attention. To help bring her mother and father into the 21st century, reach out via Twitter or email with your best products and services."
  },
  {
    "link": "https://www.digitaltrends.com/users/lesshu/",
    "name": "Les Shu",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "I am formerly a senior editor at Digital Trends. I bring with me more than a decade of tech and lifestyle journalism experience. I have written for a variety publications that include Laptop, Men\u0027s Fitness, Computer Shopper, More, Best Life, and Men\u0027s Journal. My approach to tech is simple: Highlighting the best products that are easy to use with the most bang for your buck. On the side, I am an airline nerd (I also covered travel-related articles) who enjoys building Lego sets. Find me on Twitter or Instagram."
  },
  {
    "link": "https://www.digitaltrends.com/users/gregnibler/",
    "name": "Greg Nibler",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Greg has worked as a Host, Producer, and Writer in radio and television since the early 2000s, working for such companies as CBS Radio, Alpha Broadcasting, the Portland Trail Blazers and Funemployment Radio. He feels we live in a wonderful age of technology, as it’s theoretically possible his childhood dream of owning a hoverboard, flying car and a holodeck could actually come true.."
  },
  {
    "link": "https://www.digitaltrends.com/users/bradbourque/",
    "name": "Brad Bourque",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Brad Bourque is a native Portlander, devout nerd, and craft beer enthusiast. He studied creative writing at Willamette University in Salem, Oregon before returning home to Portland. Now Brad resides in North Portland, surrounded by breweries, local music, and fellow members of the Timbers Army. Say hi to him on Twitter or Instagram, and maybe you\u0027ll run across him in a game of Heroes of the Storm."
  },
  {
    "link": "https://techcrunch.com/author/rebecca-szkutak/",
    "name": "Rebecca Szkutak",
    "workingAs": "Senior Reporter, Venture, TechCrunch",
    "detail": "\nBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal."
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/paul-sawers/",
    "name": "Paul Sawers",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nPaul Sawers is a senior writer based in London, focused largely on the world of UK And European startups. However, he also writes about other subjects that he’s passionate about, such as the business of open source software.\nPrior to TechCrunch, Paul gained more than a decade’s experience covering consumer and enterprise technologies for VentureBeat and The Next Web.\nPitches on: paul.sawers [at] techcrunch.com"
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/ivan-mehta/",
    "name": "Ivan Mehta",
    "workingAs": "Not available",
    "detail": "\nIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can reach out to him at im[at]ivanmehta[dot]com"
  },
  {
    "link": "https://techcrunch.com/author/lorenzo-franceschi-bicchierai/",
    "name": "Lorenzo Franceschi-Bicchierai",
    "workingAs": "Senior Reporter, Cybersecurity, TechCrunch",
    "detail": "\nLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. You can contact Lorenzo securely on Signal at +1 917 257 1382, on Wickr/Telegram/Wire @lorenzofb, or via email at lorenzo@techcrunch.com."
  },
  {
    "link": "https://techcrunch.com/author/marina-temkin/",
    "name": "Marina Temkin",
    "workingAs": "Reporter, Venture, TechCrunch",
    "detail": "\nMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation."
  },
  {
    "link": "https://techcrunch.com/author/matt-rosoff/",
    "name": "Matt Rosoff",
    "workingAs": "Global Managing Editor, TechCrunch",
    "detail": "\nMatt Rosoff is the Global Managing Editor of TechCrunch, based in San Francisco. He has been an editor, reporter, and analyst covering the tech industry for more than 25 years. He started his career at CNET in 1995 and has also worked for Business Insider, where he established the company’s presence on the west coast and led its tech coverage, and IDG Enterprise, where he founded and led a new publication called CITEworld. He most recently spent 7 years as an editorial director at CNBC, where he built out and managed the digital team’s coverage of the tech industry and initiated coverage of the business of climate change. Matt also spent a decade as an analyst at Directions on Microsoft, an independent firm, where he developed deep expertise on the technology and business strategy of the world’s largest tech company. In his spare time, he plays electric bass and writes fiction. Matt graduated from Williams College with a B.A. in English Lit in 1992.\n"
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/aisha-malik/",
    "name": "Aisha Malik",
    "workingAs": "Consumer News Reporter, TechCrunch",
    "detail": "\nAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University."
  },
  {
    "link": "https://techcrunch.com/author/frederic-lardinois/",
    "name": "Frederic Lardinois",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nBefore he joined TechCrunch in 2012, he founded SiliconFilter and wrote for ReadWriteWeb (now ReadWrite). Frederic covers enterprise, cloud, developer tools, Google, Microsoft, gadgets, transportation and anything else he finds interesting. He owns just over a 50th of a bitcoin."
  },
  {
    "link": "https://techcrunch.com/author/karan-bhasin/",
    "name": "Karan Bhasin",
    "workingAs": "Project Manager, TC+, TechCrunch",
    "detail": "\nKaran is an enterprising journalist who has covered beats ranging from medical to tech to entertainment. He currently conducts investor surveys for TechCrunch+. He has worked with startups in marketing and tech and occasionally finds himself on stage hosting tech events in India.\n"
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/haje-jan-kamps/",
    "name": "Haje Jan Kamps",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAt TechCrunch, Haje (He/Him) covers general tech news and focuses mostly on hardware. He has founded several companies to varying degrees of success, spent a while in the VC world, and has been a journalist and TV producer since the dawn of his career. He is more-than-averagely interested in photography and can often be found with a camera slung over his shoulder. He wrote a book about pitching startups to investors, and you can find him on @Haje on Twitter (yes, really), or at Haje.me for everything else. Disclosures."
  },
  {
    "link": "https://techcrunch.com/author/kyle-wiggers/",
    "name": "Kyle Wiggers",
    "workingAs": "Senior Reporter, Enterprise, TechCrunch",
    "detail": "\nKyle Wiggers is a senior reporter at TechCrunch with a special interest in artificial intelligence. His writing has appeared in VentureBeat and Digital Trends, as well as a range of gadget blogs including Android Police, Android Authority, Droid-Life, and XDA-Developers. He lives in Brooklyn with his partner, a piano educator, and dabbles in piano himself. occasionally — if mostly unsuccessfully."
  },
  {
    "link": "https://techcrunch.com/author/morgan-sung/",
    "name": "Morgan Sung",
    "workingAs": "Senior Reporter, Culture, TechCrunch",
    "detail": "\nMorgan Sung is a senior writer covering the wild expanse of hell that is the internet, from the murky ethics of AI-generated art to the fight for privacy rights for children of influencers. Based in Los Angeles and chronically online, Morgan writes about the creator economy, niche internet communities, and digital culture. She previously covered this space for NBC News, Mashable, and BuzzFeed. In her free time, she roller skates and fosters newborn kittens.\n"
  },
  {
    "link": "https://techcrunch.com/author/rebecca-rettig/",
    "name": "Rebecca Rettig",
    "workingAs": "Contributor",
    "detail": "\nRebecca Rettig is the chief legal and policy officer at Polygon Labs, where she oversees all global policy matters and regularly meets with policymakers and regulators across the globe. With unique and deep-rooted expertise representing companies at the forefront of the financial service industry’s digital transformation, Rebecca spent over four years advising blockchain clients on legal and regulatory matters. In 2019, Rebecca was recognized as one of the top 100 women lawyers in NYC.\n"
  },
  {
    "link": "https://techcrunch.com/author/lauren-forristal/",
    "name": "Lauren Forristal",
    "workingAs": "Not available",
    "detail": "\nLauren covers media, streaming, apps and platforms at TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/miranda-halpern/",
    "name": "Miranda Halpern",
    "workingAs": "Data Analyst, TechCrunch",
    "detail": "\nMiranda Halpern is a Data Analyst at TechCrunch+, TechCrunch’s subscription product. Before joining TechCrunch, she worked for a SaaS company in the Healthcare Industry. She can be reached at miranda.techcrunch@gmail.com or @mirandahalpern on Twitter.\n"
  },
  {
    "link": "https://techcrunch.com/author/catherine-shu/",
    "name": "Catherine Shu",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nCatherine Shu covered startups in Asia and breaking news for TechCrunch. Her reporting has also appeared in the New York Times, the Taipei Times, Barron’s, the Wall Street Journal and the Village Voice. She studied at Sarah Lawrence College and the Columbia Graduate School of Journalism.\nDisclosures: None\n"
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/morgan-sung/",
    "name": "Morgan Sung",
    "workingAs": "Senior Reporter, Culture, TechCrunch",
    "detail": "\nMorgan Sung is a senior writer covering the wild expanse of hell that is the internet, from the murky ethics of AI-generated art to the fight for privacy rights for children of influencers. Based in Los Angeles and chronically online, Morgan writes about the creator economy, niche internet communities, and digital culture. She previously covered this space for NBC News, Mashable, and BuzzFeed. In her free time, she roller skates and fosters newborn kittens.\n"
  },
  {
    "link": "https://techcrunch.com/author/rebecca-bellan/",
    "name": "Rebecca Bellan",
    "workingAs": "Senior Reporter, Transportation, TechCrunch",
    "detail": "\nRebecca Bellan covers transportation for TechCrunch. She’s interested in all things micromobility, EVs, AVs, smart cities, AI, sustainability and more. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca studied journalism and history at Boston University. She has invested in Ethereum."
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/anna-heim/",
    "name": "Anna Heim",
    "workingAs": "Freelance Reporter, TechCrunch",
    "detail": "\nAnna is a freelance reporter at TechCrunch, exploring SaaS and more. Former LATAM \u0026 Media Editor at The Next Web, startup founder and Sciences Po Paris alum."
  },
  {
    "link": "https://techcrunch.com/author/kyle-wiggers/",
    "name": "Kyle Wiggers",
    "workingAs": "Senior Reporter, Enterprise, TechCrunch",
    "detail": "\nKyle Wiggers is a senior reporter at TechCrunch with a special interest in artificial intelligence. His writing has appeared in VentureBeat and Digital Trends, as well as a range of gadget blogs including Android Police, Android Authority, Droid-Life, and XDA-Developers. He lives in Brooklyn with his partner, a piano educator, and dabbles in piano himself. occasionally — if mostly unsuccessfully."
  },
  {
    "link": "https://techcrunch.com/author/annie-njanja/",
    "name": "Annie Njanja",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nAnnie Njanja covers startups and tech news in Africa for TechCrunch. She has experience in technology, business and health reporting and has written for multiple outlets including the Thomson Reuters Foundation, and East Africa’s economics paper Business Daily and the Daily Nation, a regional newspaper. Annie has a passion for data-led journalism. She holds a MSc. degree in Data Journalism from Columbia University. For tips, please reach out to her via annie.techcrunch@gmail.com."
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/lorenzo-franceschi-bicchierai/",
    "name": "Lorenzo Franceschi-Bicchierai",
    "workingAs": "Senior Reporter, Cybersecurity, TechCrunch",
    "detail": "\nLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. You can contact Lorenzo securely on Signal at +1 917 257 1382, on Wickr/Telegram/Wire @lorenzofb, or via email at lorenzo@techcrunch.com."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/aisha-malik/",
    "name": "Aisha Malik",
    "workingAs": "Consumer News Reporter, TechCrunch",
    "detail": "\nAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/lane-kasselman/",
    "name": "Lane Kasselman",
    "workingAs": "Contributor",
    "detail": "\nLane Kasselman is the president of Blockchain.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/lauren-simonds/",
    "name": "Lauren Simonds",
    "workingAs": "Not available",
    "detail": ""
  },
  {
    "link": "https://techcrunch.com/author/adam-sanitt/",
    "name": "Dr. Adam Sanitt",
    "workingAs": "Contributor",
    "detail": "\nDr. Adam Sanitt is a knowledge director specializing in financial disputes, technology and innovation at global law firm Norton Rose Fulbright.\n"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/haje-jan-kamps/",
    "name": "Haje Jan Kamps",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAt TechCrunch, Haje (He/Him) covers general tech news and focuses mostly on hardware. He has founded several companies to varying degrees of success, spent a while in the VC world, and has been a journalist and TV producer since the dawn of his career. He is more-than-averagely interested in photography and can often be found with a camera slung over his shoulder. He wrote a book about pitching startups to investors, and you can find him on @Haje on Twitter (yes, really), or at Haje.me for everything else. Disclosures."
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/annie-njanja/",
    "name": "Annie Njanja",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nAnnie Njanja covers startups and tech news in Africa for TechCrunch. She has experience in technology, business and health reporting and has written for multiple outlets including the Thomson Reuters Foundation, and East Africa’s economics paper Business Daily and the Daily Nation, a regional newspaper. Annie has a passion for data-led journalism. She holds a MSc. degree in Data Journalism from Columbia University. For tips, please reach out to her via annie.techcrunch@gmail.com."
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/lauren-simonds/",
    "name": "Lauren Simonds",
    "workingAs": "Not available",
    "detail": ""
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/lorenzo-franceschi-bicchierai/",
    "name": "Lorenzo Franceschi-Bicchierai",
    "workingAs": "Senior Reporter, Cybersecurity, TechCrunch",
    "detail": "\nLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. You can contact Lorenzo securely on Signal at +1 917 257 1382, on Wickr/Telegram/Wire @lorenzofb, or via email at lorenzo@techcrunch.com."
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/ira-lam/",
    "name": "Ira Lam",
    "workingAs": "Contributor",
    "detail": "\nIra Lam is chief legal officer at Superlayer, a web3 venture studio for launching new multi-chain, tokenized consumer products.\n"
  },
  {
    "link": "https://techcrunch.com/author/ivan-mehta/",
    "name": "Ivan Mehta",
    "workingAs": "Not available",
    "detail": "\nIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can reach out to him at im[at]ivanmehta[dot]com"
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/haje-jan-kamps/",
    "name": "Haje Jan Kamps",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAt TechCrunch, Haje (He/Him) covers general tech news and focuses mostly on hardware. He has founded several companies to varying degrees of success, spent a while in the VC world, and has been a journalist and TV producer since the dawn of his career. He is more-than-averagely interested in photography and can often be found with a camera slung over his shoulder. He wrote a book about pitching startups to investors, and you can find him on @Haje on Twitter (yes, really), or at Haje.me for everything else. Disclosures."
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/anna-heim/",
    "name": "Anna Heim",
    "workingAs": "Freelance Reporter, TechCrunch",
    "detail": "\nAnna is a freelance reporter at TechCrunch, exploring SaaS and more. Former LATAM \u0026 Media Editor at The Next Web, startup founder and Sciences Po Paris alum."
  },
  {
    "link": "https://techcrunch.com/author/stephen-aschettino/",
    "name": "Stephen Aschettino",
    "workingAs": "Contributor",
    "detail": "\nStephen Aschettino is head of fintech, United States, at law firm Norton Rose Fulbright US LLP.\n"
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/taylor-hatmaker/",
    "name": "Taylor Hatmaker",
    "workingAs": "Culture Editor, TechCrunch",
    "detail": "\nTaylor covered social media, gaming and culture at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/paul-sawers/",
    "name": "Paul Sawers",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nPaul Sawers is a senior writer based in London, focused largely on the world of UK And European startups. However, he also writes about other subjects that he’s passionate about, such as the business of open source software.\nPrior to TechCrunch, Paul gained more than a decade’s experience covering consumer and enterprise technologies for VentureBeat and The Next Web.\nPitches on: paul.sawers [at] techcrunch.com"
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/haje-jan-kamps/",
    "name": "Haje Jan Kamps",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAt TechCrunch, Haje (He/Him) covers general tech news and focuses mostly on hardware. He has founded several companies to varying degrees of success, spent a while in the VC world, and has been a journalist and TV producer since the dawn of his career. He is more-than-averagely interested in photography and can often be found with a camera slung over his shoulder. He wrote a book about pitching startups to investors, and you can find him on @Haje on Twitter (yes, really), or at Haje.me for everything else. Disclosures."
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/rebecca-bellan/",
    "name": "Rebecca Bellan",
    "workingAs": "Senior Reporter, Transportation, TechCrunch",
    "detail": "\nRebecca Bellan covers transportation for TechCrunch. She’s interested in all things micromobility, EVs, AVs, smart cities, AI, sustainability and more. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca studied journalism and history at Boston University. She has invested in Ethereum."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/dominic-madori-davis/",
    "name": "Dominic-Madori Davis",
    "workingAs": "Senior Reporter, Venture, TechCrunch",
    "detail": "\nDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City. You can contact her on Signal at +1 (646)-831-7565."
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/rebecca-szkutak/",
    "name": "Rebecca Szkutak",
    "workingAs": "Senior Reporter, Venture, TechCrunch",
    "detail": "\nBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal."
  },
  {
    "link": "https://techcrunch.com/author/lauren-simonds/",
    "name": "Lauren Simonds",
    "workingAs": "Not available",
    "detail": ""
  },
  {
    "link": "https://techcrunch.com/author/miranda-halpern/",
    "name": "Miranda Halpern",
    "workingAs": "Data Analyst, TechCrunch",
    "detail": "\nMiranda Halpern is a Data Analyst at TechCrunch+, TechCrunch’s subscription product. Before joining TechCrunch, she worked for a SaaS company in the Healthcare Industry. She can be reached at miranda.techcrunch@gmail.com or @mirandahalpern on Twitter.\n"
  },
  {
    "link": "https://techcrunch.com/author/darrell-etherington/",
    "name": "Darrell Etherington",
    "workingAs": "Editor at Large, TechCrunch",
    "detail": "\nWriter covering space, science and health tech. Formerly covering automotive and mobility tech, and previously an employee of Apple and also of Shopify.\n"
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/nimantha-siriwardana/",
    "name": "Nimantha Siriwardana",
    "workingAs": "Contributor",
    "detail": "\nNimantha Siriwardana is the co-founder and CTO of Metacask, the marketplace for spirits-backed NFTs. Nim has over 20 years of experience in delivering technology solutions and previously worked for Goldman Sachs and Source Capital AG.\n"
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/ivan-mehta/",
    "name": "Ivan Mehta",
    "workingAs": "Not available",
    "detail": "\nIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can reach out to him at im[at]ivanmehta[dot]com"
  },
  {
    "link": "https://techcrunch.com/author/paul-sawers/",
    "name": "Paul Sawers",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nPaul Sawers is a senior writer based in London, focused largely on the world of UK And European startups. However, he also writes about other subjects that he’s passionate about, such as the business of open source software.\nPrior to TechCrunch, Paul gained more than a decade’s experience covering consumer and enterprise technologies for VentureBeat and The Next Web.\nPitches on: paul.sawers [at] techcrunch.com"
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/natasha-mascarenhas/",
    "name": "Natasha Mascarenhas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha Mascarenhas was a senior reporter at TechCrunch covering early stage startups and venture capital trends.\n"
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/lauren-simonds/",
    "name": "Lauren Simonds",
    "workingAs": "Not available",
    "detail": ""
  },
  {
    "link": "https://techcrunch.com/author/neesha-tambe/",
    "name": "Neesha Tambe",
    "workingAs": "Startup Battlefield Editor, Techcrunch",
    "detail": "\nNeesha A. Tambe recruited, sourced, vetted and trained startup founders from across the globe for TechCrunch’s global startup competition, Startup Battlefield. Passionate about scaling products and programs to new markets domestically and internationally, Neesha ran startup programs in Berlin, San Francisco, Latin America, Middle East North Africa and Sub Saharan Africa. Additionally, Neesha managed the Startup Battlefield Alumni Community and founded CrunchMatch, TechCrunch’s investor-startup matching program. Neesha wrote her thesis on Sustainability and has a dual degree in Sociology and Political Science from Georgetown University. She also has an AA from De Anza Community College. She’s passionate about social justice, civic engagement, carbon capture and reformer pilates.\n"
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/greg-kumparak/",
    "name": "Greg Kumparak",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nGreg Kumparak was an editor at TechCrunch. Greg started at TechCrunch in May of 2008 as the editor of its sister site, MobileCrunch. Greg’s coverage primarily focused on consumer companies, particularly those involving gadgets, robotics, or augmented reality. Disclosures: Greg holds shares in ETFs/mutual funds and owns a small amount of cryptocurrency (ETH, ADA)\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/anita-ramaswamy/",
    "name": "Anita Ramaswamy",
    "workingAs": "Reporter, Crypto and Fintech, TechCrunch",
    "detail": "\nAnita Ramaswamy was a reporter at TechCrunch focused on crypto and fintech. She also co-hosted TechCrunch’s weekly crypto podcast, Chain Reaction, and co-authored its companion newsletter of the same name.\nBefore TechCrunch, Anita covered financial institutions for Business Insider. Prior to becoming a journalist, she worked as an investment banking analyst at Wells Fargo Securities. You can reach her via email at anita (at) techcrunch (dot) com and follow her on Twitter at @anitaramaswamy.\nDisclosure: Anita owns small amounts of BTC, ETH, UNI and YFI for the purpose of learning more about web3 products and technology, worth under $300 combined as of 6/15/22. She does not trade any cryptocurrencies or NFTs for speculative or return-seeking purposes.\n"
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/walter-thompson/",
    "name": "Walter Thompson",
    "workingAs": "Managing Editor, Contributions, TC+, TechCrunch",
    "detail": "\nAs Editorial Manager, Walter Thompson oversees TechCrunch’s guest contributor program, which includes TechCrunch+ articles and opinion pieces about tech-related issues.\nPreviously, he worked at a number of startups in various roles and as City Editor of Hoodline. He is the host of The Golden City, a podcast about San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/ivan-mehta/",
    "name": "Ivan Mehta",
    "workingAs": "Not available",
    "detail": "\nIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can reach out to him at im[at]ivanmehta[dot]com"
  },
  {
    "link": "https://techcrunch.com/author/corey-wilton/",
    "name": "Corey Wilton",
    "workingAs": "Contributor",
    "detail": "\nCorey Wilton is the co-founder and CEO of Mirai Labs, the gaming studio behind Pegaxy.\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/devin-abbott/",
    "name": "Devin Abbott",
    "workingAs": "Contributor",
    "detail": "\nDevin Abbott was founder of Deco (acquired by Airbnb) and specializes in design and development tools, React and web3 applications, most recently with The Graph.\n"
  },
  {
    "link": "https://techcrunch.com/author/annie-njanja/",
    "name": "Annie Njanja",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nAnnie Njanja covers startups and tech news in Africa for TechCrunch. She has experience in technology, business and health reporting and has written for multiple outlets including the Thomson Reuters Foundation, and East Africa’s economics paper Business Daily and the Daily Nation, a regional newspaper. Annie has a passion for data-led journalism. She holds a MSc. degree in Data Journalism from Columbia University. For tips, please reach out to her via annie.techcrunch@gmail.com."
  },
  {
    "link": "https://techcrunch.com/author/wolfgang-ruckerl/",
    "name": "Wolfgang Rückerl",
    "workingAs": "Contributor",
    "detail": "\nWolfgang Rückerl is the co-founder and CEO of Istari Vision and Entity.\n"
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/darrell-etherington/",
    "name": "Darrell Etherington",
    "workingAs": "Editor at Large, TechCrunch",
    "detail": "\nWriter covering space, science and health tech. Formerly covering automotive and mobility tech, and previously an employee of Apple and also of Shopify.\n"
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/anita-ramaswamy/",
    "name": "Anita Ramaswamy",
    "workingAs": "Reporter, Crypto and Fintech, TechCrunch",
    "detail": "\nAnita Ramaswamy was a reporter at TechCrunch focused on crypto and fintech. She also co-hosted TechCrunch’s weekly crypto podcast, Chain Reaction, and co-authored its companion newsletter of the same name.\nBefore TechCrunch, Anita covered financial institutions for Business Insider. Prior to becoming a journalist, she worked as an investment banking analyst at Wells Fargo Securities. You can reach her via email at anita (at) techcrunch (dot) com and follow her on Twitter at @anitaramaswamy.\nDisclosure: Anita owns small amounts of BTC, ETH, UNI and YFI for the purpose of learning more about web3 products and technology, worth under $300 combined as of 6/15/22. She does not trade any cryptocurrencies or NFTs for speculative or return-seeking purposes.\n"
  },
  {
    "link": "https://techcrunch.com/author/paul-sawers/",
    "name": "Paul Sawers",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nPaul Sawers is a senior writer based in London, focused largely on the world of UK And European startups. However, he also writes about other subjects that he’s passionate about, such as the business of open source software.\nPrior to TechCrunch, Paul gained more than a decade’s experience covering consumer and enterprise technologies for VentureBeat and The Next Web.\nPitches on: paul.sawers [at] techcrunch.com"
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/stephen-aschettino/",
    "name": "Stephen Aschettino",
    "workingAs": "Contributor",
    "detail": "\nStephen Aschettino is head of fintech, United States, at law firm Norton Rose Fulbright US LLP.\n"
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/lauren-simonds/",
    "name": "Lauren Simonds",
    "workingAs": "Not available",
    "detail": ""
  },
  {
    "link": "https://techcrunch.com/author/ivan-mehta/",
    "name": "Ivan Mehta",
    "workingAs": "Not available",
    "detail": "\nIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can reach out to him at im[at]ivanmehta[dot]com"
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/walter-thompson/",
    "name": "Walter Thompson",
    "workingAs": "Managing Editor, Contributions, TC+, TechCrunch",
    "detail": "\nAs Editorial Manager, Walter Thompson oversees TechCrunch’s guest contributor program, which includes TechCrunch+ articles and opinion pieces about tech-related issues.\nPreviously, he worked at a number of startups in various roles and as City Editor of Hoodline. He is the host of The Golden City, a podcast about San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/tahem-verma/",
    "name": "Tahem Verma",
    "workingAs": "Contributor",
    "detail": "\nTahem Verma is the co-founder and CEO of Mesha, a smart management tool for web3 startups and DAOs.\n"
  },
  {
    "link": "https://techcrunch.com/author/haje-jan-kamps/",
    "name": "Haje Jan Kamps",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAt TechCrunch, Haje (He/Him) covers general tech news and focuses mostly on hardware. He has founded several companies to varying degrees of success, spent a while in the VC world, and has been a journalist and TV producer since the dawn of his career. He is more-than-averagely interested in photography and can often be found with a camera slung over his shoulder. He wrote a book about pitching startups to investors, and you can find him on @Haje on Twitter (yes, really), or at Haje.me for everything else. Disclosures."
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/tom-fleetham/",
    "name": "Tom Fleetham",
    "workingAs": "Contributor",
    "detail": "\nTom Fleetham is the head of sports and gaming at Zilliqa, where he is helping scale up partnerships in the next phase of its growth.\n"
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/nikhil-sachdev/",
    "name": "Nikhil Sachdev",
    "workingAs": "Contributor",
    "detail": "\nNikhil Sachdev is a managing director at Insight Partners, where he focuses on investments in high-growth software, fintech and crypto companies.\n"
  },
  {
    "link": "https://techcrunch.com/author/jenny-q-ta/",
    "name": "Jenny Q. Ta",
    "workingAs": "Contributor",
    "detail": "\nJenny Q. Ta is the CEO of GalaxE.io by HODL Assets.\n"
  },
  {
    "link": "https://techcrunch.com/author/greg-kumparak/",
    "name": "Greg Kumparak",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nGreg Kumparak was an editor at TechCrunch. Greg started at TechCrunch in May of 2008 as the editor of its sister site, MobileCrunch. Greg’s coverage primarily focused on consumer companies, particularly those involving gadgets, robotics, or augmented reality. Disclosures: Greg holds shares in ETFs/mutual funds and owns a small amount of cryptocurrency (ETH, ADA)\n"
  },
  {
    "link": "https://techcrunch.com/author/rebecca-bellan/",
    "name": "Rebecca Bellan",
    "workingAs": "Senior Reporter, Transportation, TechCrunch",
    "detail": "\nRebecca Bellan covers transportation for TechCrunch. She’s interested in all things micromobility, EVs, AVs, smart cities, AI, sustainability and more. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca studied journalism and history at Boston University. She has invested in Ethereum."
  },
  {
    "link": "https://techcrunch.com/author/vadym-synegin/",
    "name": "Vadym Synegin",
    "workingAs": "Contributor",
    "detail": "\nVadym Synegin is a Ukrainian impact entrepreneur, philanthropist and investor in fintech and crypto projects with more than 15 years’ experience as an entrepreneur in Europe and the UAE.\n"
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/kristen-corpion/",
    "name": "Kristen Corpion",
    "workingAs": "Contributor",
    "detail": "\nKristen Corpion is the founder of CORPlaw, a Miami-based law firm serving fast-growing technology companies and entrepreneurs as fractional general counsel.\n"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/doug-petkanics/",
    "name": "Doug Petkanics",
    "workingAs": "Contributor",
    "detail": "\nDoug Petkanics is the co-founder and CEO of Livepeer, an open video infrastructure for livestreaming.\n"
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/jagmeet-singh/",
    "name": "Jagmeet Singh",
    "workingAs": "Not available",
    "detail": "\nJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. You can reach out to him at mail[at]journalistjagmeet[dot]com."
  },
  {
    "link": "https://techcrunch.com/author/harri-weber/",
    "name": "Harri Weber",
    "workingAs": "Senior Reporter, Climate, TechCrunch",
    "detail": "\nHarri Weber was a senior writer at TechCrunch covering climate. Her work has also appeared in Gizmodo, Fast Company, VentureBeat, dot.LA, Input and The Next Web. Get in touch: harri@harri.fm"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/kyle-wiggers/",
    "name": "Kyle Wiggers",
    "workingAs": "Senior Reporter, Enterprise, TechCrunch",
    "detail": "\nKyle Wiggers is a senior reporter at TechCrunch with a special interest in artificial intelligence. His writing has appeared in VentureBeat and Digital Trends, as well as a range of gadget blogs including Android Police, Android Authority, Droid-Life, and XDA-Developers. He lives in Brooklyn with his partner, a piano educator, and dabbles in piano himself. occasionally — if mostly unsuccessfully."
  },
  {
    "link": "https://techcrunch.com/author/anna-heim/",
    "name": "Anna Heim",
    "workingAs": "Freelance Reporter, TechCrunch",
    "detail": "\nAnna is a freelance reporter at TechCrunch, exploring SaaS and more. Former LATAM \u0026 Media Editor at The Next Web, startup founder and Sciences Po Paris alum."
  },
  {
    "link": "https://techcrunch.com/author/jagmeet-singh/",
    "name": "Jagmeet Singh",
    "workingAs": "Not available",
    "detail": "\nJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. You can reach out to him at mail[at]journalistjagmeet[dot]com."
  },
  {
    "link": "https://techcrunch.com/author/anita-ramaswamy/",
    "name": "Anita Ramaswamy",
    "workingAs": "Reporter, Crypto and Fintech, TechCrunch",
    "detail": "\nAnita Ramaswamy was a reporter at TechCrunch focused on crypto and fintech. She also co-hosted TechCrunch’s weekly crypto podcast, Chain Reaction, and co-authored its companion newsletter of the same name.\nBefore TechCrunch, Anita covered financial institutions for Business Insider. Prior to becoming a journalist, she worked as an investment banking analyst at Wells Fargo Securities. You can reach her via email at anita (at) techcrunch (dot) com and follow her on Twitter at @anitaramaswamy.\nDisclosure: Anita owns small amounts of BTC, ETH, UNI and YFI for the purpose of learning more about web3 products and technology, worth under $300 combined as of 6/15/22. She does not trade any cryptocurrencies or NFTs for speculative or return-seeking purposes.\n"
  },
  {
    "link": "https://techcrunch.com/author/lauren-simonds/",
    "name": "Lauren Simonds",
    "workingAs": "Not available",
    "detail": ""
  },
  {
    "link": "https://techcrunch.com/author/walter-thompson/",
    "name": "Walter Thompson",
    "workingAs": "Managing Editor, Contributions, TC+, TechCrunch",
    "detail": "\nAs Editorial Manager, Walter Thompson oversees TechCrunch’s guest contributor program, which includes TechCrunch+ articles and opinion pieces about tech-related issues.\nPreviously, he worked at a number of startups in various roles and as City Editor of Hoodline. He is the host of The Golden City, a podcast about San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/karan-bhasin/",
    "name": "Karan Bhasin",
    "workingAs": "Project Manager, TC+, TechCrunch",
    "detail": "\nKaran is an enterprising journalist who has covered beats ranging from medical to tech to entertainment. He currently conducts investor surveys for TechCrunch+. He has worked with startups in marketing and tech and occasionally finds himself on stage hosting tech events in India.\n"
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/ivan-mehta/",
    "name": "Ivan Mehta",
    "workingAs": "Not available",
    "detail": "\nIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can reach out to him at im[at]ivanmehta[dot]com"
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/brian-heater/",
    "name": "Brian Heater",
    "workingAs": "Hardware Editor, TechCrunch",
    "detail": "\nBrian Heater is the Hardware Editor at TechCrunch. He worked for a number of leading tech publications, including Engadget, PCMag, Laptop, and Tech Times, where he served as the Managing Editor. His writing has appeared in Spin, Wired, Playboy, Entertainment Weekly, The Onion, Boing Boing, Publishers Weekly, The Daily Beast and various other publications. He hosts the weekly Boing Boing interview podcast RiYL, has appeared as a regular NPR contributor and shares his Queens apartment with a rabbit named Juniper."
  },
  {
    "link": "https://techcrunch.com/author/aisha-malik/",
    "name": "Aisha Malik",
    "workingAs": "Consumer News Reporter, TechCrunch",
    "detail": "\nAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University."
  },
  {
    "link": "https://techcrunch.com/author/neesha-tambe/",
    "name": "Neesha Tambe",
    "workingAs": "Startup Battlefield Editor, Techcrunch",
    "detail": "\nNeesha A. Tambe recruited, sourced, vetted and trained startup founders from across the globe for TechCrunch’s global startup competition, Startup Battlefield. Passionate about scaling products and programs to new markets domestically and internationally, Neesha ran startup programs in Berlin, San Francisco, Latin America, Middle East North Africa and Sub Saharan Africa. Additionally, Neesha managed the Startup Battlefield Alumni Community and founded CrunchMatch, TechCrunch’s investor-startup matching program. Neesha wrote her thesis on Sustainability and has a dual degree in Sociology and Political Science from Georgetown University. She also has an AA from De Anza Community College. She’s passionate about social justice, civic engagement, carbon capture and reformer pilates.\n"
  },
  {
    "link": "https://techcrunch.com/author/jordan-crook/",
    "name": "Jordan Crook",
    "workingAs": "TechCrunch",
    "detail": "\nJordan Crook was the Deputy Editor of TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/natasha-mascarenhas/",
    "name": "Natasha Mascarenhas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha Mascarenhas was a senior reporter at TechCrunch covering early stage startups and venture capital trends.\n"
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/frederic-lardinois/",
    "name": "Frederic Lardinois",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nBefore he joined TechCrunch in 2012, he founded SiliconFilter and wrote for ReadWriteWeb (now ReadWrite). Frederic covers enterprise, cloud, developer tools, Google, Microsoft, gadgets, transportation and anything else he finds interesting. He owns just over a 50th of a bitcoin."
  },
  {
    "link": "https://techcrunch.com/author/greg-kumparak/",
    "name": "Greg Kumparak",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nGreg Kumparak was an editor at TechCrunch. Greg started at TechCrunch in May of 2008 as the editor of its sister site, MobileCrunch. Greg’s coverage primarily focused on consumer companies, particularly those involving gadgets, robotics, or augmented reality. Disclosures: Greg holds shares in ETFs/mutual funds and owns a small amount of cryptocurrency (ETH, ADA)\n"
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/anita-ramaswamy/",
    "name": "Anita Ramaswamy",
    "workingAs": "Reporter, Crypto and Fintech, TechCrunch",
    "detail": "\nAnita Ramaswamy was a reporter at TechCrunch focused on crypto and fintech. She also co-hosted TechCrunch’s weekly crypto podcast, Chain Reaction, and co-authored its companion newsletter of the same name.\nBefore TechCrunch, Anita covered financial institutions for Business Insider. Prior to becoming a journalist, she worked as an investment banking analyst at Wells Fargo Securities. You can reach her via email at anita (at) techcrunch (dot) com and follow her on Twitter at @anitaramaswamy.\nDisclosure: Anita owns small amounts of BTC, ETH, UNI and YFI for the purpose of learning more about web3 products and technology, worth under $300 combined as of 6/15/22. She does not trade any cryptocurrencies or NFTs for speculative or return-seeking purposes.\n"
  },
  {
    "link": "https://techcrunch.com/author/neesha-tambe/",
    "name": "Neesha Tambe",
    "workingAs": "Startup Battlefield Editor, Techcrunch",
    "detail": "\nNeesha A. Tambe recruited, sourced, vetted and trained startup founders from across the globe for TechCrunch’s global startup competition, Startup Battlefield. Passionate about scaling products and programs to new markets domestically and internationally, Neesha ran startup programs in Berlin, San Francisco, Latin America, Middle East North Africa and Sub Saharan Africa. Additionally, Neesha managed the Startup Battlefield Alumni Community and founded CrunchMatch, TechCrunch’s investor-startup matching program. Neesha wrote her thesis on Sustainability and has a dual degree in Sociology and Political Science from Georgetown University. She also has an AA from De Anza Community College. She’s passionate about social justice, civic engagement, carbon capture and reformer pilates.\n"
  },
  {
    "link": "https://techcrunch.com/author/jacquelyn-melinek/",
    "name": "Jacquelyn Melinek",
    "workingAs": "Senior Reporter, Crypto, TechCrunch",
    "detail": "\nJacquelyn Melinek was a reporter at TechCrunch covering cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/aisha-malik/",
    "name": "Aisha Malik",
    "workingAs": "Consumer News Reporter, TechCrunch",
    "detail": "\nAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University."
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/annie-njanja/",
    "name": "Annie Njanja",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nAnnie Njanja covers startups and tech news in Africa for TechCrunch. She has experience in technology, business and health reporting and has written for multiple outlets including the Thomson Reuters Foundation, and East Africa’s economics paper Business Daily and the Daily Nation, a regional newspaper. Annie has a passion for data-led journalism. She holds a MSc. degree in Data Journalism from Columbia University. For tips, please reach out to her via annie.techcrunch@gmail.com."
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/rebecca-bellan/",
    "name": "Rebecca Bellan",
    "workingAs": "Senior Reporter, Transportation, TechCrunch",
    "detail": "\nRebecca Bellan covers transportation for TechCrunch. She’s interested in all things micromobility, EVs, AVs, smart cities, AI, sustainability and more. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca studied journalism and history at Boston University. She has invested in Ethereum."
  },
  {
    "link": "https://techcrunch.com/author/harri-weber/",
    "name": "Harri Weber",
    "workingAs": "Senior Reporter, Climate, TechCrunch",
    "detail": "\nHarri Weber was a senior writer at TechCrunch covering climate. Her work has also appeared in Gizmodo, Fast Company, VentureBeat, dot.LA, Input and The Next Web. Get in touch: harri@harri.fm"
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/lauren-forristal/",
    "name": "Lauren Forristal",
    "workingAs": "Not available",
    "detail": "\nLauren covers media, streaming, apps and platforms at TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/walter-thompson/",
    "name": "Walter Thompson",
    "workingAs": "Managing Editor, Contributions, TC+, TechCrunch",
    "detail": "\nAs Editorial Manager, Walter Thompson oversees TechCrunch’s guest contributor program, which includes TechCrunch+ articles and opinion pieces about tech-related issues.\nPreviously, he worked at a number of startups in various roles and as City Editor of Hoodline. He is the host of The Golden City, a podcast about San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/aliya-chaudhry/",
    "name": "Aliya Chaudhry",
    "workingAs": "Not available",
    "detail": ""
  },
  {
    "link": "https://techcrunch.com/author/ram-iyer/",
    "name": "Ram Iyer",
    "workingAs": "Editor, TC+, TechCrunch",
    "detail": "\nRam is a financial and tech reporter and editor. He covered North American and European M\u0026A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\n"
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/alexandra-ames/",
    "name": "Alexandra Ames",
    "workingAs": "Director of Marketing, TechCrunch",
    "detail": "\nShe has implemented experiential and digital marketing campaigns with brands such as RSA Conference, Qualcomm, Nissan, and Hyundai and has been responsible for event audience development and branding at TechCrunch since 2014.\n"
  },
  {
    "link": "https://techcrunch.com/author/warren-rogers/",
    "name": "Warren Rogers",
    "workingAs": "Contributor",
    "detail": "\nWarren Rogers is CFO at Blockware Solutions, a former venture capitalist and founder, and a blockchain maximalist.\n"
  },
  {
    "link": "https://techcrunch.com/author/alexandre-robicquet/",
    "name": "Alexandre Robicquet",
    "workingAs": "Co-Founder \u0026 CEO, Crossing Minds",
    "detail": "\nAlexandre Robicquet is co-founder and CEO of Crossing Minds, an AI-powered recommendation platform for e-commerce and content. An experienced Stanford AI scholar, he holds three Master’s degrees in mathematics, machine learning and artificial intelligence.\n"
  },
  {
    "link": "https://techcrunch.com/author/audrey-handem/",
    "name": "Audrey Handem",
    "workingAs": "Contributor",
    "detail": "\nAudrey is a VC at Speedinvest, a pan-European early-stage fund.\n"
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/walter-thompson/",
    "name": "Walter Thompson",
    "workingAs": "Managing Editor, Contributions, TC+, TechCrunch",
    "detail": "\nAs Editorial Manager, Walter Thompson oversees TechCrunch’s guest contributor program, which includes TechCrunch+ articles and opinion pieces about tech-related issues.\nPreviously, he worked at a number of startups in various roles and as City Editor of Hoodline. He is the host of The Golden City, a podcast about San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/alexandra-ames/",
    "name": "Alexandra Ames",
    "workingAs": "Director of Marketing, TechCrunch",
    "detail": "\nShe has implemented experiential and digital marketing campaigns with brands such as RSA Conference, Qualcomm, Nissan, and Hyundai and has been responsible for event audience development and branding at TechCrunch since 2014.\n"
  },
  {
    "link": "https://techcrunch.com/author/anita-ramaswamy/",
    "name": "Anita Ramaswamy",
    "workingAs": "Reporter, Crypto and Fintech, TechCrunch",
    "detail": "\nAnita Ramaswamy was a reporter at TechCrunch focused on crypto and fintech. She also co-hosted TechCrunch’s weekly crypto podcast, Chain Reaction, and co-authored its companion newsletter of the same name.\nBefore TechCrunch, Anita covered financial institutions for Business Insider. Prior to becoming a journalist, she worked as an investment banking analyst at Wells Fargo Securities. You can reach her via email at anita (at) techcrunch (dot) com and follow her on Twitter at @anitaramaswamy.\nDisclosure: Anita owns small amounts of BTC, ETH, UNI and YFI for the purpose of learning more about web3 products and technology, worth under $300 combined as of 6/15/22. She does not trade any cryptocurrencies or NFTs for speculative or return-seeking purposes.\n"
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/pam-kreuger/",
    "name": "Pam Krueger",
    "workingAs": "Contributor",
    "detail": "\nPam Krueger is the founder and CEO of Wealthramp.com, a free online service that matches consumers with qualified, fee-only financial advisers, and the creator and host of the investor-education television series “MoneyTrack.”\n"
  },
  {
    "link": "https://techcrunch.com/author/john-biggs-2/",
    "name": "John Biggs",
    "workingAs": "Contributor, Tech4Reporters",
    "detail": "\nJohn Biggs is a writer, consultant, programmer, former East Coast Editor and current contributing writer for TechCrunch. He writes mainly about technology, cryptocurrency, security, gadgets, gear, wristwatches, and the internet. After spending his formative years as a programmer, he switched his profession and became a full-time entrepreneur andwriter. His work has appeared in the New York Times, Laptop, PC Upgrade, Surge, Gizmodo, Men’s Health, InSync, Linux Journal, Popular Science, Sync, and he has written a book called Black Hat: Misfits, Criminals, and Scammers in the Internet Age.\n"
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/catherine-shu/",
    "name": "Catherine Shu",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nCatherine Shu covered startups in Asia and breaking news for TechCrunch. Her reporting has also appeared in the New York Times, the Taipei Times, Barron’s, the Wall Street Journal and the Village Voice. She studied at Sarah Lawrence College and the Columbia Graduate School of Journalism.\nDisclosures: None\n"
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/annie-njanja/",
    "name": "Annie Njanja",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nAnnie Njanja covers startups and tech news in Africa for TechCrunch. She has experience in technology, business and health reporting and has written for multiple outlets including the Thomson Reuters Foundation, and East Africa’s economics paper Business Daily and the Daily Nation, a regional newspaper. Annie has a passion for data-led journalism. She holds a MSc. degree in Data Journalism from Columbia University. For tips, please reach out to her via annie.techcrunch@gmail.com."
  },
  {
    "link": "https://techcrunch.com/author/carly-page/",
    "name": "Carly Page",
    "workingAs": "Sr. Reporter, Cybersecurity, TechCrunch",
    "detail": "\nCarly Page is a Senior Reporter at TechCrunch, where she covers the cybersecurity beat. She has spent more than a decade in the technology industry, writing for titles including Forbes, TechRadar and WIRED.\nYou can contact Carly securely on Signal at +441536 853956 or via email at carly.page@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/haje-jan-kamps/",
    "name": "Haje Jan Kamps",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAt TechCrunch, Haje (He/Him) covers general tech news and focuses mostly on hardware. He has founded several companies to varying degrees of success, spent a while in the VC world, and has been a journalist and TV producer since the dawn of his career. He is more-than-averagely interested in photography and can often be found with a camera slung over his shoulder. He wrote a book about pitching startups to investors, and you can find him on @Haje on Twitter (yes, really), or at Haje.me for everything else. Disclosures."
  },
  {
    "link": "https://techcrunch.com/author/miranda-halpern/",
    "name": "Miranda Halpern",
    "workingAs": "Data Analyst, TechCrunch",
    "detail": "\nMiranda Halpern is a Data Analyst at TechCrunch+, TechCrunch’s subscription product. Before joining TechCrunch, she worked for a SaaS company in the Healthcare Industry. She can be reached at miranda.techcrunch@gmail.com or @mirandahalpern on Twitter.\n"
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/jarno-mikael-koponen/",
    "name": "Jarno M. Koponen",
    "workingAs": "Contributor",
    "detail": "\nJarno M. Koponen is working on intelligent systems and human-centered personalization. He currently is product lead at Yle, one of the leading media houses in the Nordics.\n"
  },
  {
    "link": "https://techcrunch.com/author/sergiu-matei/",
    "name": "Sergiu Matei",
    "workingAs": "Contributor",
    "detail": "\nSergiu Matei is the founder of Index, a platform that helps teams find and hire world-class remote software developers and be globally compliant from the get-go.\n"
  },
  {
    "link": "https://techcrunch.com/author/wei-lien-dang/",
    "name": "Wei Lien Dang",
    "workingAs": "Contributor",
    "detail": "\nWei Lien Dang is a general partner at Unusual Ventures, leading investments in security, infrastructure software and developer tools. He was previously co-founder of StackRox, a cloud-native security company acquired by Red Hat.\n"
  },
  {
    "link": "https://techcrunch.com/author/alexis-ronickher/",
    "name": "Alexis Ronickher",
    "workingAs": "Contributor",
    "detail": "\nAlexis Ronickher is a partner at Katz, Marshall \u0026 Banks LLP, a whistleblower and civil rights law firm in Washington, D.C. She specialized in representing whistleblowers.\n"
  },
  {
    "link": "https://techcrunch.com/author/chris-fortier/",
    "name": "Chris Fortier",
    "workingAs": "Contributor",
    "detail": "\nChris Fortier is VP of Product at Rally, a platform for creators and fan communities to build shared economies powered by social tokens and digital goods and services.\n"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/parker-mccurley/",
    "name": "Parker McCurley",
    "workingAs": "Contributor",
    "detail": "\nParker McCurley is the co-founder and CEO of Decent Labs.\n"
  },
  {
    "link": "https://techcrunch.com/author/clara-bullrich/",
    "name": "Clara Bullrich",
    "workingAs": "Contributor",
    "detail": "\nClara Bullrich is co-founder of TheVentureCity, and has participated in more than 50 NFT and cryptocurrency deals and is on the board of Liquid Meta, a decentralized finance infrastructure and technology company.\n"
  },
  {
    "link": "https://techcrunch.com/author/andreiko-kerdemelidis/",
    "name": "Andreiko Kerdemelidis",
    "workingAs": "Contributor",
    "detail": "\nAndreiko Kerdemelidis is the CTO and co-founder of Kuva.\n"
  },
  {
    "link": "https://techcrunch.com/author/rodrigo-vicuna/",
    "name": "Rodrigo Vicuna",
    "workingAs": "Contributor",
    "detail": "\nRodrigo Vicuna is chief financial officer at Prime Trust.\n"
  },
  {
    "link": "https://techcrunch.com/author/jon-fingas/",
    "name": "Jon Fingas",
    "workingAs": "Contributor",
    "detail": "\nJon Fingas is a contributing writer at Engadget.\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/karan-bhasin/",
    "name": "Karan Bhasin",
    "workingAs": "Project Manager, TC+, TechCrunch",
    "detail": "\nKaran is an enterprising journalist who has covered beats ranging from medical to tech to entertainment. He currently conducts investor surveys for TechCrunch+. He has worked with startups in marketing and tech and occasionally finds himself on stage hosting tech events in India.\n"
  },
  {
    "link": "https://techcrunch.com/author/kay-khemani/",
    "name": "Kay Khemani",
    "workingAs": "Contributor",
    "detail": "\nKay Khemani is the managing director of Spectre.ai\n"
  },
  {
    "link": "https://techcrunch.com/author/david-donovan/",
    "name": "David Donovan",
    "workingAs": "Contributor",
    "detail": "\nDavid Donovan leads the Global Financial Services Practice for the Americas for digital consultancy Publicis Sapient and is a former Fidelity Investments executive.\n"
  },
  {
    "link": "https://techcrunch.com/author/prerna-gupta/",
    "name": "Prerna Gupta",
    "workingAs": "Contributor",
    "detail": "\nPrerna Gupta has launched mobile entertainment apps, like Hooked and Smule, reaching over a billion people. She is currently working on a stealth project in the NFT space.\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/ben-parr/",
    "name": "Ben Parr",
    "workingAs": "Contributor",
    "detail": "\nBen Parr is president and co-founder of Octane AI.\n"
  },
  {
    "link": "https://techcrunch.com/author/alex-holmes/",
    "name": "Alex Holmes",
    "workingAs": "Chairman \u0026 CEO, MoneyGram",
    "detail": "\nAlex Holmes is chairman and CEO of MoneyGram International, the global leader in the evolution of digital P2P payments.\n"
  },
  {
    "link": "https://techcrunch.com/author/rebecca-bellan/",
    "name": "Rebecca Bellan",
    "workingAs": "Senior Reporter, Transportation, TechCrunch",
    "detail": "\nRebecca Bellan covers transportation for TechCrunch. She’s interested in all things micromobility, EVs, AVs, smart cities, AI, sustainability and more. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca studied journalism and history at Boston University. She has invested in Ethereum."
  },
  {
    "link": "https://techcrunch.com/author/connor-spelliscy/",
    "name": "Connor Spelliscy",
    "workingAs": "Contributor",
    "detail": "\nConnor Spelliscy is a blockchain researcher focused on policy and governance. He founded the DAO Research Collective and co-founded blockchain advocacy organizations in the U.S. and Canada.\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/brooks-rainwater/",
    "name": "Brooks Rainwater",
    "workingAs": "Not available",
    "detail": "\nBrooks Rainwater is the director of the Center for City Solutions and Applied Research at the National League of Cities.\n"
  },
  {
    "link": "https://techcrunch.com/author/kate-park/",
    "name": "Kate Park",
    "workingAs": "Reporter, Asia, TechCrunch",
    "detail": "\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M\u0026A, private equity and venture capital."
  },
  {
    "link": "https://techcrunch.com/author/natasha-mascarenhas/",
    "name": "Natasha Mascarenhas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha Mascarenhas was a senior reporter at TechCrunch covering early stage startups and venture capital trends.\n"
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/brian-heater/",
    "name": "Brian Heater",
    "workingAs": "Hardware Editor, TechCrunch",
    "detail": "\nBrian Heater is the Hardware Editor at TechCrunch. He worked for a number of leading tech publications, including Engadget, PCMag, Laptop, and Tech Times, where he served as the Managing Editor. His writing has appeared in Spin, Wired, Playboy, Entertainment Weekly, The Onion, Boing Boing, Publishers Weekly, The Daily Beast and various other publications. He hosts the weekly Boing Boing interview podcast RiYL, has appeared as a regular NPR contributor and shares his Queens apartment with a rabbit named Juniper."
  },
  {
    "link": "https://techcrunch.com/author/walter-thompson/",
    "name": "Walter Thompson",
    "workingAs": "Managing Editor, Contributions, TC+, TechCrunch",
    "detail": "\nAs Editorial Manager, Walter Thompson oversees TechCrunch’s guest contributor program, which includes TechCrunch+ articles and opinion pieces about tech-related issues.\nPreviously, he worked at a number of startups in various roles and as City Editor of Hoodline. He is the host of The Golden City, a podcast about San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/anna-heim/",
    "name": "Anna Heim",
    "workingAs": "Freelance Reporter, TechCrunch",
    "detail": "\nAnna is a freelance reporter at TechCrunch, exploring SaaS and more. Former LATAM \u0026 Media Editor at The Next Web, startup founder and Sciences Po Paris alum."
  },
  {
    "link": "https://techcrunch.com/author/seamus-donoghue/",
    "name": "Seamus Donoghue",
    "workingAs": "Contributor",
    "detail": "\nSeamus Donoghue is the VP of Strategic Alliances at METACO.\n"
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/annie-njanja/",
    "name": "Annie Njanja",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nAnnie Njanja covers startups and tech news in Africa for TechCrunch. She has experience in technology, business and health reporting and has written for multiple outlets including the Thomson Reuters Foundation, and East Africa’s economics paper Business Daily and the Daily Nation, a regional newspaper. Annie has a passion for data-led journalism. She holds a MSc. degree in Data Journalism from Columbia University. For tips, please reach out to her via annie.techcrunch@gmail.com."
  },
  {
    "link": "https://techcrunch.com/author/benjamin-whitby/",
    "name": "Benjamin Whitby",
    "workingAs": "Contributor",
    "detail": "\nBenjamin Whitby oversees regulatory affairs at Qredo, a cross-chain protocol for asset managers and traders active in the digital asset markets.\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/anita-ramaswamy/",
    "name": "Anita Ramaswamy",
    "workingAs": "Reporter, Crypto and Fintech, TechCrunch",
    "detail": "\nAnita Ramaswamy was a reporter at TechCrunch focused on crypto and fintech. She also co-hosted TechCrunch’s weekly crypto podcast, Chain Reaction, and co-authored its companion newsletter of the same name.\nBefore TechCrunch, Anita covered financial institutions for Business Insider. Prior to becoming a journalist, she worked as an investment banking analyst at Wells Fargo Securities. You can reach her via email at anita (at) techcrunch (dot) com and follow her on Twitter at @anitaramaswamy.\nDisclosure: Anita owns small amounts of BTC, ETH, UNI and YFI for the purpose of learning more about web3 products and technology, worth under $300 combined as of 6/15/22. She does not trade any cryptocurrencies or NFTs for speculative or return-seeking purposes.\n"
  },
  {
    "link": "https://techcrunch.com/author/donald-r-cravins-jr/",
    "name": "Donald R. Cravins Jr.",
    "workingAs": "Contributor",
    "detail": "\nDonald R. Cravins Jr. is the executive vice president of the National Urban League.\n"
  },
  {
    "link": "https://techcrunch.com/author/bob-greenlee/",
    "name": "Bob Greenlee",
    "workingAs": "Contributor",
    "detail": "\nBob Greenlee is the COO of Tusk Holdings and has advised the Tezos Foundation, Circle, Neema, eToro and others in the crypto space.\n"
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/christopher-morton/",
    "name": "Christopher Morton",
    "workingAs": "Contributor",
    "detail": "\nChristopher Morton is COO of Cognito.\n"
  },
  {
    "link": "https://techcrunch.com/author/taylor-hatmaker/",
    "name": "Taylor Hatmaker",
    "workingAs": "Culture Editor, TechCrunch",
    "detail": "\nTaylor covered social media, gaming and culture at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/leigh-cuen/",
    "name": "Leigh Cuen",
    "workingAs": "Contributor",
    "detail": "\nLeigh Cuen is a reporter in New York City. Her work has been published by Vice, Business Insider, Newsweek, Teen Vogue, Al Jazeera English, The Jerusalem Post, and many others. Follow her on Instagram at @leighcuen.\n"
  },
  {
    "link": "https://techcrunch.com/author/martine/",
    "name": "Martine Paris",
    "workingAs": "Columnist",
    "detail": "\nMartine Paris is a freelance tech reporter covering space, electric vehicles, climate tech, robotics, AI, consumer tech, e-commerce, streaming, gaming, venture capital and startup culture.\n"
  },
  {
    "link": "https://techcrunch.com/author/ram-iyer/",
    "name": "Ram Iyer",
    "workingAs": "Editor, TC+, TechCrunch",
    "detail": "\nRam is a financial and tech reporter and editor. He covered North American and European M\u0026A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\n"
  },
  {
    "link": "https://techcrunch.com/author/anja-manuel/",
    "name": "Anja Manuel",
    "workingAs": "Contributor",
    "detail": "\nAnja Manuel is the co-founder of Rice, Hadley, Gates \u0026 Manuel LLC (RHGM), a strategic consulting firm, and the director of the Aspen Security Forum. She previously served as an American diplomat and is a board member of Ripple, a premier blockchain payments company.\n"
  },
  {
    "link": "https://techcrunch.com/author/michael-maizels/",
    "name": "Michael Maizels",
    "workingAs": "Contributor",
    "detail": "\nAn art historian by training, Michael Maizels is a multidisciplinary researcher working at the intersection of creativity, technology and economics. His next book, a new study on business model evolution in postwar art history, will be out in 2021.\n"
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/ashley-tolbert/",
    "name": "Ashley Tolbert",
    "workingAs": "Contributor",
    "detail": "\nAshley Tolbert is an information security researcher and engineer.\n"
  },
  {
    "link": "https://techcrunch.com/author/michiel-berende/",
    "name": "Michiel Berende",
    "workingAs": "Contributor",
    "detail": "\nMichiel Berende, the chief inclusive officer at Etherisc, believes in delivering better financial services access to those who need it most through inclusive insurance.\n"
  },
  {
    "link": "https://techcrunch.com/author/joshua-jahani/",
    "name": "Joshua Jahani",
    "workingAs": "Contributor",
    "detail": "\nJoshua Jahani is a lecturer at Cornell University and New York University, and a board adviser at the investment bank Jahani and Associates specializing in the Middle East and Africa.\n"
  },
  {
    "link": "https://techcrunch.com/author/matthew-panzarino/",
    "name": "Matthew Panzarino",
    "workingAs": "Advisor, TechCrunch",
    "detail": "\nMatthew Panzarino served as Editor in Chief of TechCrunch for a decade. Previously, he was News Editor and Managing Editor at The Next Web, founded photography businesses and a news blog covering the Apple ecosystem. He has made a name for himself in the tech media world as a writer and editor covering Apple, Disney, robotics and fashion in addition to a broad range of startups in the fields of robotics, computer vision, AI, VR, AR and more. Disclosures: Holds shares in ETFs, ETH and various NFTs. Contact Matthew at matthew@techcrunch.com PGP Key: https://keybase.io/panzer\n"
  },
  {
    "link": "https://techcrunch.com/author/david-kirichenko/",
    "name": "David Kirichenko",
    "workingAs": "Contributor",
    "detail": "\nDavid Kirichenko is an editor at Euromaidan Press and writes about cyberspace, digital currencies, economics and technology.\n"
  },
  {
    "link": "https://techcrunch.com/author/asheesh-birla/",
    "name": "Asheesh Birla",
    "workingAs": "Contributor",
    "detail": "\nAsheesh Birla is the GM of RippleNet at Ripple.\n"
  },
  {
    "link": "https://techcrunch.com/author/darrell-etherington/",
    "name": "Darrell Etherington",
    "workingAs": "Editor at Large, TechCrunch",
    "detail": "\nWriter covering space, science and health tech. Formerly covering automotive and mobility tech, and previously an employee of Apple and also of Shopify.\n"
  },
  {
    "link": "https://techcrunch.com/author/jonathan-stringfield/",
    "name": "Jonathan Stringfield",
    "workingAs": "Contributor",
    "detail": "\nJonathan Stringfield, Ph.D., is VP and global head of Business Marketing, Measurement and Insights at Activision Blizzard Media and Esports.\n"
  },
  {
    "link": "https://techcrunch.com/author/harry-alford/",
    "name": "Harry Alford",
    "workingAs": "Contributor",
    "detail": "\nHarry Alford is a business development manager at Coinbase Cloud, formerly Bison Trails, where he leads sales and business development efforts for key protocols and engagements with major financial institutions, funds, exchanges and custodians.\n"
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/kyle-russell/",
    "name": "Kyle Russell",
    "workingAs": "Not available",
    "detail": "\nKyle Russell is a writer at TechCrunch. Previously, he reported on Apple, enterprise, and streaming media at Business Insider.\n"
  },
  {
    "link": "https://techcrunch.com/author/taylor-hatmaker/",
    "name": "Taylor Hatmaker",
    "workingAs": "Culture Editor, TechCrunch",
    "detail": "\nTaylor covered social media, gaming and culture at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/pete-ramsey/",
    "name": "Peter Ramsey",
    "workingAs": "Contributor",
    "detail": "\nPeter Ramsey is CEO of Built For Mars, a UX consultancy that helps customers build better product experiences.\n"
  },
  {
    "link": "https://techcrunch.com/author/bremner-morris/",
    "name": "Bremner Morris",
    "workingAs": "Contributor",
    "detail": "\nBremner Morris is CMO/CRO of Rally, a crypto platform that allows creators and artists to launch their own digital currency and build sustainable, independent economies with their fan communities. Previously, he was head of global go-to-market and revenue at Patreon.\n"
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/henrik-gebbing/",
    "name": "Henrik Gebbing",
    "workingAs": "Contributor",
    "detail": "\nHenrik Gebbing is co-CEO and co-founder of Finoa, a leading European digital asset custody and financial services platform for institutional investors and corporations.\n"
  },
  {
    "link": "https://techcrunch.com/author/mary-ann-azevedo-2/",
    "name": "Mary Ann Azevedo",
    "workingAs": "Sr. Reporter, TechCrunch",
    "detail": "\nMary Ann Azevedo has more than 20 years of business reporting and editing experience for publications such as FinLedger, Crunchbase News, Crain, Forbes and Silicon Valley Business Journal. Prior to joining TechCrunch in 2021, she earned numerous awards including the New York Times Chairman’s Award and others for breaking news coverage. She holds a Master’s degree in journalism from the University of Texas in Austin, where she currently lives."
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/amanda-silberling/",
    "name": "Amanda Silberling",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nAmanda Silberling covers social media and consumer tech at TechCrunch. She has written about internet culture for Polygon, MTV, Business Insider, NPR, and the AV Club, and she co-hosts Wow If True, a podcast about going viral. Prior to joining TechCrunch, she was a grassroots organizer, museum educator, and film festival coordinator. Based in Philadelphia, she holds a B.A. in English from the University of Pennsylvania and was a Princeton in Asia Fellow in Laos. Find her at amandasilberling.com or on Twitter at @asilbwrites."
  },
  {
    "link": "https://techcrunch.com/author/christine-hall/",
    "name": "Christine Hall",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nChristine Hall writes about enterprise/B2B, e-commerce, and foodtech. She most recently reported on venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for publications including the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. Email her at \u003ca href\u003d\"mailto:chall.techcrunch@gmail.com or on Twitter at @christinemhall."
  },
  {
    "link": "https://techcrunch.com/author/mohammed-ibrahim-jega/",
    "name": "Mohammed Ibrahim Jega",
    "workingAs": "Contributor",
    "detail": "\nMohammed Ibrahim Jega is the co-founder of Domineum Blockchain Solutions, a serial tech entrepreneur, startup adviser, fintech expert and blockchain advocate.\n"
  },
  {
    "link": "https://techcrunch.com/author/danny-crichton-2/",
    "name": "Danny Crichton",
    "workingAs": "Contributor, TechCrunch",
    "detail": "\nDanny Crichton is an investor at CRV and a former contributing writer at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/harrison-jordan/",
    "name": "Harrison Jordan",
    "workingAs": "Contributor",
    "detail": "\nHarrison Jordan is the founder and CEO of HUP.LIFE\n"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/andrew-shikiar/",
    "name": "Andrew Shikiar",
    "workingAs": "Contributor",
    "detail": "\nAndrew Shikiar is the executive director and CMO of FIDO Alliance.\n"
  },
  {
    "link": "https://techcrunch.com/author/monica-long/",
    "name": "Monica Long",
    "workingAs": "Contributor",
    "detail": "\nMonica Long is the GM of RippleX.\n"
  },
  {
    "link": "https://techcrunch.com/author/catherine-shu/",
    "name": "Catherine Shu",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nCatherine Shu covered startups in Asia and breaking news for TechCrunch. Her reporting has also appeared in the New York Times, the Taipei Times, Barron’s, the Wall Street Journal and the Village Voice. She studied at Sarah Lawrence College and the Columbia Graduate School of Journalism.\nDisclosures: None\n"
  },
  {
    "link": "https://techcrunch.com/author/rebecca-bellan/",
    "name": "Rebecca Bellan",
    "workingAs": "Senior Reporter, Transportation, TechCrunch",
    "detail": "\nRebecca Bellan covers transportation for TechCrunch. She’s interested in all things micromobility, EVs, AVs, smart cities, AI, sustainability and more. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca studied journalism and history at Boston University. She has invested in Ethereum."
  },
  {
    "link": "https://techcrunch.com/author/anthony-ha/",
    "name": "Anthony Ha",
    "workingAs": "TechCrunch",
    "detail": "\nAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech writer at Adweek, a senior editor at the tech blog VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a venture capital firm. He lives in New York City."
  },
  {
    "link": "https://techcrunch.com/author/tage-kene-okafor/",
    "name": "Tage Kene-Okafor",
    "workingAs": "Reporter, Africa, TechCrunch",
    "detail": "\nTage Kene-Okafor covers startups and investment activities in Nigeria and Africa for TechCrunch. Before this, Tage reported on the same beat for Techpoint Africa.\nYou can hit him up at tage.techcrunch@gmail.com"
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/erin-bury/",
    "name": "Erin Bury",
    "workingAs": "Contributor",
    "detail": "\nErin Bury is CEO and co-founder of Willful, a comprehensive online estate planning service based in Toronto.\n"
  },
  {
    "link": "https://techcrunch.com/author/dominik-schiener/",
    "name": "Dominik Schiener",
    "workingAs": "Contributor",
    "detail": "\nDominik Schiener is co-founder and chairman of the IOTA Foundation. He has been in the blockchain space since 2011, with several startups in Switzerland, the U.K. and Germany. His primary focus is how to improve physical infrastructure with digital infrastructure such as DLT and AI.\n"
  },
  {
    "link": "https://techcrunch.com/author/leigh-cuen/",
    "name": "Leigh Cuen",
    "workingAs": "Contributor",
    "detail": "\nLeigh Cuen is a reporter in New York City. Her work has been published by Vice, Business Insider, Newsweek, Teen Vogue, Al Jazeera English, The Jerusalem Post, and many others. Follow her on Instagram at @leighcuen.\n"
  },
  {
    "link": "https://techcrunch.com/author/darrell-etherington/",
    "name": "Darrell Etherington",
    "workingAs": "Editor at Large, TechCrunch",
    "detail": "\nWriter covering space, science and health tech. Formerly covering automotive and mobility tech, and previously an employee of Apple and also of Shopify.\n"
  },
  {
    "link": "https://techcrunch.com/author/zack-whittaker/",
    "name": "Zack Whittaker",
    "workingAs": "Security Editor, TechCrunch",
    "detail": "\nZack Whittaker is the security editor at TechCrunch. You can send tips securely via Signal and WhatsApp to +1 646-755-8849. He can also be reached by email at zack.whittaker@techcrunch.com."
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/megan-rose-dickey/",
    "name": "Megan Rose Dickey",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nMegan Rose Dickey is a senior reporter at TechCrunch focused on labor, transportation, and diversity and inclusion in tech.\nShe previously spent two years at Business Insider covering tech startups focused on the shared economy, IoT and music industry.\nShe graduated from the University of Southern California in 2011 with a degree in Broadcast and Digital Journalism.\n– See more at: https://www.crunchbase.com/person/megan-rose-dickey#sthash.ir4VFt2z.dpuf\nPGP fingerprint for email is: 2FA7 6E54 4652 781A B365 BE2E FBD7 9C5F 3DAE 56BD\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/cooper-turley/",
    "name": "Cooper Turley",
    "workingAs": "Contributor",
    "detail": "\nCooper is the crypto strategy lead at Audius. He manages social tokens like RAC and FWB and curates NFTs alongside prominent musicians and motion designers. He is an active contributor to web3 publications like The Defiant and Bankless and oversees a DeFi newsletter (This Week in DeFi). He is most active on Twitter.\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/danny-crichton-2/",
    "name": "Danny Crichton",
    "workingAs": "Contributor, TechCrunch",
    "detail": "\nDanny Crichton is an investor at CRV and a former contributing writer at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/leigh-cuen/",
    "name": "Leigh Cuen",
    "workingAs": "Contributor",
    "detail": "\nLeigh Cuen is a reporter in New York City. Her work has been published by Vice, Business Insider, Newsweek, Teen Vogue, Al Jazeera English, The Jerusalem Post, and many others. Follow her on Instagram at @leighcuen.\n"
  },
  {
    "link": "https://techcrunch.com/author/jonathan-shieber/",
    "name": "Jonathan Shieber",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJonathan was an editor at TechCrunch./p\u003e\n"
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/catherine-shu/",
    "name": "Catherine Shu",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nCatherine Shu covered startups in Asia and breaking news for TechCrunch. Her reporting has also appeared in the New York Times, the Taipei Times, Barron’s, the Wall Street Journal and the Village Voice. She studied at Sarah Lawrence College and the Columbia Graduate School of Journalism.\nDisclosures: None\n"
  },
  {
    "link": "https://techcrunch.com/author/asheesh-birla/",
    "name": "Asheesh Birla",
    "workingAs": "Contributor",
    "detail": "\nAsheesh Birla is the GM of RippleNet at Ripple.\n"
  },
  {
    "link": "https://techcrunch.com/author/anthony-ha/",
    "name": "Anthony Ha",
    "workingAs": "TechCrunch",
    "detail": "\nAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech writer at Adweek, a senior editor at the tech blog VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a venture capital firm. He lives in New York City."
  },
  {
    "link": "https://techcrunch.com/author/zack-whittaker/",
    "name": "Zack Whittaker",
    "workingAs": "Security Editor, TechCrunch",
    "detail": "\nZack Whittaker is the security editor at TechCrunch. You can send tips securely via Signal and WhatsApp to +1 646-755-8849. He can also be reached by email at zack.whittaker@techcrunch.com."
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/scott-purcell/",
    "name": "Scott Purcell",
    "workingAs": "Contributor",
    "detail": "\nScott Purcell is the CEO and chief trust officer of Prime Trust, an innovative API-enabled B2B open-banking financial solutions provider.\n"
  },
  {
    "link": "https://techcrunch.com/author/matthew-panzarino/",
    "name": "Matthew Panzarino",
    "workingAs": "Advisor, TechCrunch",
    "detail": "\nMatthew Panzarino served as Editor in Chief of TechCrunch for a decade. Previously, he was News Editor and Managing Editor at The Next Web, founded photography businesses and a news blog covering the Apple ecosystem. He has made a name for himself in the tech media world as a writer and editor covering Apple, Disney, robotics and fashion in addition to a broad range of startups in the fields of robotics, computer vision, AI, VR, AR and more. Disclosures: Holds shares in ETFs, ETH and various NFTs. Contact Matthew at matthew@techcrunch.com PGP Key: https://keybase.io/panzer\n"
  },
  {
    "link": "https://techcrunch.com/author/mauro-guillen/",
    "name": "Mauro Guillen",
    "workingAs": "Contributor",
    "detail": "\nMauro Guillen is a professor of international management at the Wharton School and the author of “2030: How the Biggest Trends Today will Collide and Shape the Future of Everything,” from which this essay is adapted.\n"
  },
  {
    "link": "https://techcrunch.com/author/anupam-datta/",
    "name": "Anupam Datta",
    "workingAs": "Contributor",
    "detail": "\nAnupam Datta is co-founder, president and chief scientist of Truera, and also a professor at Carnegie Mellon University.\n"
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/frederic-lardinois/",
    "name": "Frederic Lardinois",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nBefore he joined TechCrunch in 2012, he founded SiliconFilter and wrote for ReadWriteWeb (now ReadWrite). Frederic covers enterprise, cloud, developer tools, Google, Microsoft, gadgets, transportation and anything else he finds interesting. He owns just over a 50th of a bitcoin."
  },
  {
    "link": "https://techcrunch.com/author/alfred-chuang/",
    "name": "Alfred Chuang",
    "workingAs": "Founder and General Partner, Race Capital",
    "detail": "\nAlfred Chuang is general partner at Race Capital, an early-stage venture capital firm.\n"
  },
  {
    "link": "https://techcrunch.com/author/zoran-basich/",
    "name": "Zoran Basich",
    "workingAs": "Contributor",
    "detail": "\nZoran Basich is the crypto editor for Andreessen Horowitz.\n"
  },
  {
    "link": "https://techcrunch.com/author/anthony-zhang/",
    "name": "Anthony Zhang",
    "workingAs": "Contributor",
    "detail": "\nAnthony is co-founder and CEO of Vinovest, a platform for investing in fine wine. He has previously founded and sold two companies (EnvoyNow \u0026 Know Your VC), and is also a Thiel Fellow.\n"
  },
  {
    "link": "https://techcrunch.com/author/ryoma-ito/",
    "name": "Ryoma Ito",
    "workingAs": "Contributor",
    "detail": "\nRyoma Ito is co-founder of MakersPlace, a community empowering the world’s digital creators. In prior roles, he co-founded a B2B e-commerce subscription business servicing 100k+ online merchants, was VP of Product at Specialdeals and was employee No. 1 at two venture-backed startups, one of which was acquired by Groupon.\n"
  },
  {
    "link": "https://techcrunch.com/author/josh-constine/",
    "name": "Josh Constine",
    "workingAs": "Not available",
    "detail": "\nJosh Constine is a Principal investor and Head Of Content at venture capital fund SignalFire. He invests in early stage startups across verticals with a focus on social apps, visual communication, remote work, entertainment \u0026 media, and tech’s transformation of new sectors. Constine also creates content for SignalFire, drawing on data insights from the fund’s predictive recruiting engine Beacon and invested advisor network of 75 top tech leaders. SignalFire is currently investing from its $200 million seed fund and $300 million breakout fund, and has backed startups like Uber, Grammarly, Ro, Alchemy, and ClassDojo.\nConstine currently writes a weekly newsletter called Moving Product at https://constine.substack.com/ where he discusses big ideas facing the startup industry, the most exciting new tech products, and interviews top industry talent about the most important recent launches.\nPreviously, Constine was the Editor-At-Large for TechCrunch where he wrote over 3500 blog posts about social tech giants like Facebook and Snapchat as well as early stage startups across verticals. His work was cited on the floors of the Senate and House Of Representatives, and led to the shut down of Facebook’s Onavo market surveillance app.\nConstine was formerly the Lead Writer of Inside Facebook through its acquisition by WebMediaBrands, covering everything about the social network.\nConstine graduated from Stanford University in 2009 with a Master’s degree in Cybersociology, examining the influence of technology on social interaction. He researched the impact of privacy controls on the socialization of children, meme popularity cycles, and what influences the click through rate of links posted to Twitter. Constine also received a Bachelor of Arts degree with honors from Stanford University in 2007, with a concentration in Social Psychology \u0026 Interpersonal Processes.\nJosh Constine is an experienced public speaker, and has moderated over 190 on-stage interviews in 18 countries with leaders including Facebook CEO Mark Zuckerberg, Instagram’s founders, whistleblower Edward Snowden (via on-stage video conference), and U.S. Senator Cory Booker. He also delivers keynotes on how to pitch startups, press strategy for tech companies, and how to turn your passion into your profession. He is available to moderate panels and fireside chats, provide keynotes, and judge hackathon and pitch competitions. You can contact him at Joshsc [at] gmail .com\nConstine has been quoted by The Wall Street Journal, CNN Money, The Atlantic, BBC World Magazine, Slate, and more, plus has been featured on television on Good Morning, America, The Today Show, China Central Television, and Fox News. Constine was ranked as the #1 most cited tech journalist on prestigious news aggregator Techmeme from 2016 to 2020.\n"
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/jonathan-johnson/",
    "name": "Jonathan Johnson",
    "workingAs": "Contributor",
    "detail": "\nJonathan Johnson is president of Medici Ventures and CEO of Overstock.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/brian-heater/",
    "name": "Brian Heater",
    "workingAs": "Hardware Editor, TechCrunch",
    "detail": "\nBrian Heater is the Hardware Editor at TechCrunch. He worked for a number of leading tech publications, including Engadget, PCMag, Laptop, and Tech Times, where he served as the Managing Editor. His writing has appeared in Spin, Wired, Playboy, Entertainment Weekly, The Onion, Boing Boing, Publishers Weekly, The Daily Beast and various other publications. He hosts the weekly Boing Boing interview podcast RiYL, has appeared as a regular NPR contributor and shares his Queens apartment with a rabbit named Juniper."
  },
  {
    "link": "https://techcrunch.com/author/greg-kumparak/",
    "name": "Greg Kumparak",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nGreg Kumparak was an editor at TechCrunch. Greg started at TechCrunch in May of 2008 as the editor of its sister site, MobileCrunch. Greg’s coverage primarily focused on consumer companies, particularly those involving gadgets, robotics, or augmented reality. Disclosures: Greg holds shares in ETFs/mutual funds and owns a small amount of cryptocurrency (ETH, ADA)\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/jonathan-shieber/",
    "name": "Jonathan Shieber",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJonathan was an editor at TechCrunch./p\u003e\n"
  },
  {
    "link": "https://techcrunch.com/author/anthony-ha/",
    "name": "Anthony Ha",
    "workingAs": "TechCrunch",
    "detail": "\nAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech writer at Adweek, a senior editor at the tech blog VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a venture capital firm. He lives in New York City."
  },
  {
    "link": "https://techcrunch.com/author/catherine-shu/",
    "name": "Catherine Shu",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nCatherine Shu covered startups in Asia and breaking news for TechCrunch. Her reporting has also appeared in the New York Times, the Taipei Times, Barron’s, the Wall Street Journal and the Village Voice. She studied at Sarah Lawrence College and the Columbia Graduate School of Journalism.\nDisclosures: None\n"
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/manish-singh/",
    "name": "Manish Singh",
    "workingAs": "Reporter, India, TechCrunch",
    "detail": "\nManish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com."
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/zack-whittaker/",
    "name": "Zack Whittaker",
    "workingAs": "Security Editor, TechCrunch",
    "detail": "\nZack Whittaker is the security editor at TechCrunch. You can send tips securely via Signal and WhatsApp to +1 646-755-8849. He can also be reached by email at zack.whittaker@techcrunch.com."
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/josh-constine/",
    "name": "Josh Constine",
    "workingAs": "Not available",
    "detail": "\nJosh Constine is a Principal investor and Head Of Content at venture capital fund SignalFire. He invests in early stage startups across verticals with a focus on social apps, visual communication, remote work, entertainment \u0026 media, and tech’s transformation of new sectors. Constine also creates content for SignalFire, drawing on data insights from the fund’s predictive recruiting engine Beacon and invested advisor network of 75 top tech leaders. SignalFire is currently investing from its $200 million seed fund and $300 million breakout fund, and has backed startups like Uber, Grammarly, Ro, Alchemy, and ClassDojo.\nConstine currently writes a weekly newsletter called Moving Product at https://constine.substack.com/ where he discusses big ideas facing the startup industry, the most exciting new tech products, and interviews top industry talent about the most important recent launches.\nPreviously, Constine was the Editor-At-Large for TechCrunch where he wrote over 3500 blog posts about social tech giants like Facebook and Snapchat as well as early stage startups across verticals. His work was cited on the floors of the Senate and House Of Representatives, and led to the shut down of Facebook’s Onavo market surveillance app.\nConstine was formerly the Lead Writer of Inside Facebook through its acquisition by WebMediaBrands, covering everything about the social network.\nConstine graduated from Stanford University in 2009 with a Master’s degree in Cybersociology, examining the influence of technology on social interaction. He researched the impact of privacy controls on the socialization of children, meme popularity cycles, and what influences the click through rate of links posted to Twitter. Constine also received a Bachelor of Arts degree with honors from Stanford University in 2007, with a concentration in Social Psychology \u0026 Interpersonal Processes.\nJosh Constine is an experienced public speaker, and has moderated over 190 on-stage interviews in 18 countries with leaders including Facebook CEO Mark Zuckerberg, Instagram’s founders, whistleblower Edward Snowden (via on-stage video conference), and U.S. Senator Cory Booker. He also delivers keynotes on how to pitch startups, press strategy for tech companies, and how to turn your passion into your profession. He is available to moderate panels and fireside chats, provide keynotes, and judge hackathon and pitch competitions. You can contact him at Joshsc [at] gmail .com\nConstine has been quoted by The Wall Street Journal, CNN Money, The Atlantic, BBC World Magazine, Slate, and more, plus has been featured on television on Good Morning, America, The Today Show, China Central Television, and Fox News. Constine was ranked as the #1 most cited tech journalist on prestigious news aggregator Techmeme from 2016 to 2020.\n"
  },
  {
    "link": "https://techcrunch.com/author/gregg-schoenberg-2/",
    "name": "Gregg Schoenberg",
    "workingAs": "Founder, Wescott Inc.",
    "detail": "\nGregg is a TechCrunch contributor focused on Fintech. In addition to financial services innovation, he is involved in ESG/Sustainability, media entrepreneurship and the intersection of technology, economics and policy. Recently, he was Co-founder/Showrunner for The Financial Revolutionist. Previous roles included serving as a capital markets investment banker, angel investor, crisis communications advisor, corporate lobbyist and legislative aide.\nGregg Schoenberg received his B.A. from Washington University in St. Louis and his MBA from Cornell University.\n"
  },
  {
    "link": "https://techcrunch.com/author/danny-crichton-2/",
    "name": "Danny Crichton",
    "workingAs": "Contributor, TechCrunch",
    "detail": "\nDanny Crichton is an investor at CRV and a former contributing writer at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/nik-milanovic/",
    "name": "Nik Milanovic",
    "workingAs": "Founder, This Week in Fintech; General Partner, The Fintech Fund",
    "detail": "\nNik Milanovic is a fintech and financial inclusion enthusiast, with a decade of work across mobile payments, online lending, credit and microfinance. The opinions expressed in his articles do not reflect those of his employer(s).\n"
  },
  {
    "link": "https://techcrunch.com/author/darrell-etherington/",
    "name": "Darrell Etherington",
    "workingAs": "Editor at Large, TechCrunch",
    "detail": "\nWriter covering space, science and health tech. Formerly covering automotive and mobility tech, and previously an employee of Apple and also of Shopify.\n"
  },
  {
    "link": "https://techcrunch.com/author/jon-russell/",
    "name": "Jon Russell",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJon Russell was a reporter for TechCrunch covering all things tech in Asia, in particular the major players in China, India and Southeast Asia. Originally from the UK, he is based in Bangkok and has lived in Thailand since 2008.\n"
  },
  {
    "link": "https://techcrunch.com/author/dave-davis/",
    "name": "Dave Davis",
    "workingAs": "Not available",
    "detail": "\nDave Davis joined Copyright Clearance Center in 1994 and currently serves as a research analyst. He previously held directorships in both public libraries and corporate libraries and earned joint master’s degrees in Library and Information Sciences and Medieval European History from Catholic University of America.\n"
  },
  {
    "link": "https://techcrunch.com/author/julian-shapiro/",
    "name": "Julian Shapiro",
    "workingAs": "Contributor",
    "detail": "\nJulian Shapiro is the founder of BellCurve.com, a growth marketing team that trains startups in advanced growth, helps hire senior growth marketers and finds vetted growth agencies. He also writes at Julian.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/jake-bright-2/",
    "name": "Jake Bright",
    "workingAs": "Contributor, Fast Forward Venture Studio",
    "detail": "\nJake Bright is a writer, author and advisor with a focus on global business, politics, and technology.\nFrom 2017 to 2020, he was a contributing writer and advisor at TechCrunch where he published on Africa, mobility and politics. Bright helped spearhead consistent Africa coverage and co-produce the first Startup Battlefield competitions in Africa and Africa focused programming on the Disrupt San Francisco mainstage.\nBright’s first book, The Next Africa (Macmillan 2015), forecast the rise of Africa’s venture backed startup scene. Prior to this he worked in international finance and as a speechwriter in Washington, DC. Bright continues to contribute occasional guest pieces at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/sulaiman-al-fahim/",
    "name": "Sulaiman al-Fahim",
    "workingAs": "Not available",
    "detail": "\nSulaiman al-Fahim is an international businessman based in Dubai with focuses on property management/real estate, cryptocurrency, and philanthropy. His company, Sulaiman Al-Fahim Holdings, is a global operator that facilitates transactions to develop properties in various areas of the world. He is also an advisor and partner at ADAB Solutions, a group dedicated to bringing the newest movement in financial tech to the Muslim world.\n"
  },
  {
    "link": "https://techcrunch.com/author/arman-tabatabai/",
    "name": "Arman Tabatabai",
    "workingAs": "Not available",
    "detail": "\nArman focuses on venture capital, startups and urban tech at TechCrunch. Previously, he worked as an equity analyst at Morgan Stanley covering the Power, Utilities \u0026 Clean Tech sectors. Arman is based in New York City and can be contacted via email at arman.tabatabai@techcrunch.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/jon-evans/",
    "name": "Jon Evans",
    "workingAs": "CTO, HappyFunCorp",
    "detail": "\nJon Evans is the CTO of the engineering consultancy HappyFunCorp; the award-winning author of six novels, one graphic novel, and a book of travel writing; and TechCrunch’s weekend columnist since 2010.\n"
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/frederic-lardinois/",
    "name": "Frederic Lardinois",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nBefore he joined TechCrunch in 2012, he founded SiliconFilter and wrote for ReadWriteWeb (now ReadWrite). Frederic covers enterprise, cloud, developer tools, Google, Microsoft, gadgets, transportation and anything else he finds interesting. He owns just over a 50th of a bitcoin."
  },
  {
    "link": "https://techcrunch.com/author/rita-liao/",
    "name": "Rita Liao",
    "workingAs": "Reporter, China, TechCrunch",
    "detail": "\nRita covers Asia for TechCrunch, with a special interest in Chinese companies going global and web3 projects with real-world applications.\nBefore her previous writing stints with Tech in Asia and TechNode, Rita managed communications for SOSV’s accelerators in Asia. At one point, she worked for a documentary production company and a mindfulness retreat center in New England.\nShe studied political science and visual arts at Bowdoin College.\nContact: ritaliao@pm.me"
  },
  {
    "link": "Not available",
    "name": "Not available",
    "workingAs": "Not available",
    "detail": "Not available"
  },
  {
    "link": "https://techcrunch.com/author/chandan-lodha/",
    "name": "Chandan Lodha",
    "workingAs": "Not available",
    "detail": "\nChandan Lodha is co-founder at CoinTracker, a Y Combinator and Initialized Capital-backed startup that offers a secure cryptocurrency tax calculator. He was previously the Product Manager on Project Loon at Google[x].\n"
  },
  {
    "link": "https://techcrunch.com/author/galen-moore/",
    "name": "Galen Moore",
    "workingAs": "Not available",
    "detail": "\nGalen Moore is director of Business Development at New Alchemy.\n"
  },
  {
    "link": "https://techcrunch.com/author/brian-heater/",
    "name": "Brian Heater",
    "workingAs": "Hardware Editor, TechCrunch",
    "detail": "\nBrian Heater is the Hardware Editor at TechCrunch. He worked for a number of leading tech publications, including Engadget, PCMag, Laptop, and Tech Times, where he served as the Managing Editor. His writing has appeared in Spin, Wired, Playboy, Entertainment Weekly, The Onion, Boing Boing, Publishers Weekly, The Daily Beast and various other publications. He hosts the weekly Boing Boing interview podcast RiYL, has appeared as a regular NPR contributor and shares his Queens apartment with a rabbit named Juniper."
  },
  {
    "link": "https://techcrunch.com/author/taylor-hatmaker/",
    "name": "Taylor Hatmaker",
    "workingAs": "Culture Editor, TechCrunch",
    "detail": "\nTaylor covered social media, gaming and culture at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/bilgin-ibryam/",
    "name": "Bilgin Ibryam",
    "workingAs": "Not available",
    "detail": "\nBilgin Ibryam is a principal architect at Red Hat, committer and member of Apache Software Foundation. He is an open-source evangelist, blogger, occasional speaker and the author of Kubernetes Patterns and Camel Design Patterns.\n"
  },
  {
    "link": "https://techcrunch.com/author/kate-clark/",
    "name": "Kate Clark",
    "workingAs": "Writer, The Information",
    "detail": "\nKate Clark was a reporter at TechCrunch covering venture capital and startups.\n"
  },
  {
    "link": "https://techcrunch.com/author/thibault-schrepel/",
    "name": "Thibault Schrepel",
    "workingAs": "Not available",
    "detail": "\nThibault Schrepel is an Assistant Professor in the Department of Public Economic Law at Utrecht University and a reviewer at the Stanford Journal of Blockchain Law \u0026 Policy.\n"
  },
  {
    "link": "https://techcrunch.com/author/sarah-perez/",
    "name": "Sarah Perez",
    "workingAs": "Consumer News Editor, TechCrunch",
    "detail": "\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software."
  },
  {
    "link": "https://techcrunch.com/author/john-biggs-2/",
    "name": "John Biggs",
    "workingAs": "Contributor, Tech4Reporters",
    "detail": "\nJohn Biggs is a writer, consultant, programmer, former East Coast Editor and current contributing writer for TechCrunch. He writes mainly about technology, cryptocurrency, security, gadgets, gear, wristwatches, and the internet. After spending his formative years as a programmer, he switched his profession and became a full-time entrepreneur andwriter. His work has appeared in the New York Times, Laptop, PC Upgrade, Surge, Gizmodo, Men’s Health, InSync, Linux Journal, Popular Science, Sync, and he has written a book called Black Hat: Misfits, Criminals, and Scammers in the Internet Age.\n"
  },
  {
    "link": "https://techcrunch.com/author/jonathan-shieber/",
    "name": "Jonathan Shieber",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJonathan was an editor at TechCrunch./p\u003e\n"
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/matthew-carpenter-arevalo/",
    "name": "Matthew Carpenter-Arévalo",
    "workingAs": "Contributor",
    "detail": "\nMatthew Carpenter-Arévalo is a former Google and Twitter manager and current CEO of Céntrico Digital, a Latin American-based digital agency.\n"
  },
  {
    "link": "https://techcrunch.com/author/john-biggs-2/",
    "name": "John Biggs",
    "workingAs": "Contributor, Tech4Reporters",
    "detail": "\nJohn Biggs is a writer, consultant, programmer, former East Coast Editor and current contributing writer for TechCrunch. He writes mainly about technology, cryptocurrency, security, gadgets, gear, wristwatches, and the internet. After spending his formative years as a programmer, he switched his profession and became a full-time entrepreneur andwriter. His work has appeared in the New York Times, Laptop, PC Upgrade, Surge, Gizmodo, Men’s Health, InSync, Linux Journal, Popular Science, Sync, and he has written a book called Black Hat: Misfits, Criminals, and Scammers in the Internet Age.\n"
  },
  {
    "link": "https://techcrunch.com/author/kate-clark/",
    "name": "Kate Clark",
    "workingAs": "Writer, The Information",
    "detail": "\nKate Clark was a reporter at TechCrunch covering venture capital and startups.\n"
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/jon-russell/",
    "name": "Jon Russell",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJon Russell was a reporter for TechCrunch covering all things tech in Asia, in particular the major players in China, India and Southeast Asia. Originally from the UK, he is based in Bangkok and has lived in Thailand since 2008.\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/zack-whittaker/",
    "name": "Zack Whittaker",
    "workingAs": "Security Editor, TechCrunch",
    "detail": "\nZack Whittaker is the security editor at TechCrunch. You can send tips securely via Signal and WhatsApp to +1 646-755-8849. He can also be reached by email at zack.whittaker@techcrunch.com."
  },
  {
    "link": "https://techcrunch.com/author/jonathan-johnson/",
    "name": "Jonathan Johnson",
    "workingAs": "Contributor",
    "detail": "\nJonathan Johnson is president of Medici Ventures and CEO of Overstock.com.\n"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/brian-heater/",
    "name": "Brian Heater",
    "workingAs": "Hardware Editor, TechCrunch",
    "detail": "\nBrian Heater is the Hardware Editor at TechCrunch. He worked for a number of leading tech publications, including Engadget, PCMag, Laptop, and Tech Times, where he served as the Managing Editor. His writing has appeared in Spin, Wired, Playboy, Entertainment Weekly, The Onion, Boing Boing, Publishers Weekly, The Daily Beast and various other publications. He hosts the weekly Boing Boing interview podcast RiYL, has appeared as a regular NPR contributor and shares his Queens apartment with a rabbit named Juniper."
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/joyce-yang-2/",
    "name": "Joyce Yang",
    "workingAs": "Founder, Global Coin Research.",
    "detail": "\nJoyce is the founder of Global Coin Research (GlobalCoinResearch.com), a subscription-based media platform that provides insights and analysis into the Cryptocurrency and Blockchain space, with a focus on Asia. She is also a contributor at TechCrunch covering Cryptocurrency and Blockchain.\nPreviously, Joyce spent a year at Blue Apron as the first hire on the operations finance team during a hyper-growth period in the technology-enabled e-commerce company.\nPrior to Blue Apron, Joyce was a Software Senior Equity Research Analyst at Bank of America Merrill Lynch. Notable coverage companies include Salesforce, Oracle, Symantec, Box and Red Hat.\nJoyce earned her B.A. at Harvard University.\nSee her full ethics statement and disclosure at https://globalcoinresearch.com/ethics/\nJoyce owns bitcoin and ethereum. Enough to gain an understanding, not enough to change a life. She is based in New York.\n"
  },
  {
    "link": "https://techcrunch.com/author/josh-constine/",
    "name": "Josh Constine",
    "workingAs": "Not available",
    "detail": "\nJosh Constine is a Principal investor and Head Of Content at venture capital fund SignalFire. He invests in early stage startups across verticals with a focus on social apps, visual communication, remote work, entertainment \u0026 media, and tech’s transformation of new sectors. Constine also creates content for SignalFire, drawing on data insights from the fund’s predictive recruiting engine Beacon and invested advisor network of 75 top tech leaders. SignalFire is currently investing from its $200 million seed fund and $300 million breakout fund, and has backed startups like Uber, Grammarly, Ro, Alchemy, and ClassDojo.\nConstine currently writes a weekly newsletter called Moving Product at https://constine.substack.com/ where he discusses big ideas facing the startup industry, the most exciting new tech products, and interviews top industry talent about the most important recent launches.\nPreviously, Constine was the Editor-At-Large for TechCrunch where he wrote over 3500 blog posts about social tech giants like Facebook and Snapchat as well as early stage startups across verticals. His work was cited on the floors of the Senate and House Of Representatives, and led to the shut down of Facebook’s Onavo market surveillance app.\nConstine was formerly the Lead Writer of Inside Facebook through its acquisition by WebMediaBrands, covering everything about the social network.\nConstine graduated from Stanford University in 2009 with a Master’s degree in Cybersociology, examining the influence of technology on social interaction. He researched the impact of privacy controls on the socialization of children, meme popularity cycles, and what influences the click through rate of links posted to Twitter. Constine also received a Bachelor of Arts degree with honors from Stanford University in 2007, with a concentration in Social Psychology \u0026 Interpersonal Processes.\nJosh Constine is an experienced public speaker, and has moderated over 190 on-stage interviews in 18 countries with leaders including Facebook CEO Mark Zuckerberg, Instagram’s founders, whistleblower Edward Snowden (via on-stage video conference), and U.S. Senator Cory Booker. He also delivers keynotes on how to pitch startups, press strategy for tech companies, and how to turn your passion into your profession. He is available to moderate panels and fireside chats, provide keynotes, and judge hackathon and pitch competitions. You can contact him at Joshsc [at] gmail .com\nConstine has been quoted by The Wall Street Journal, CNN Money, The Atlantic, BBC World Magazine, Slate, and more, plus has been featured on television on Good Morning, America, The Today Show, China Central Television, and Fox News. Constine was ranked as the #1 most cited tech journalist on prestigious news aggregator Techmeme from 2016 to 2020.\n"
  },
  {
    "link": "https://techcrunch.com/author/taylor-hatmaker/",
    "name": "Taylor Hatmaker",
    "workingAs": "Culture Editor, TechCrunch",
    "detail": "\nTaylor covered social media, gaming and culture at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/anthony-ha/",
    "name": "Anthony Ha",
    "workingAs": "TechCrunch",
    "detail": "\nAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech writer at Adweek, a senior editor at the tech blog VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a venture capital firm. He lives in New York City."
  },
  {
    "link": "https://techcrunch.com/author/alex-wilhelm/",
    "name": "Alex Wilhelm",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nAlex Wilhelm was a senior reporter for TechCrunch covering the markets, venture capital and startups. He was also the founding host of TechCrunch’s Webby Award-winning podcast Equity."
  },
  {
    "link": "https://techcrunch.com/author/danny-crichton-2/",
    "name": "Danny Crichton",
    "workingAs": "Contributor, TechCrunch",
    "detail": "\nDanny Crichton is an investor at CRV and a former contributing writer at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/kirsten-korosec/",
    "name": "Kirsten Korosec",
    "workingAs": "Transportation Editor, TechCrunch",
    "detail": "\nSenior reporter and editor at TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/jed-grant/",
    "name": "Jed Grant",
    "workingAs": "Not available",
    "detail": "\nJed Grant has more than 25 years of experience in technology, finance and security. He is the founder and CEO of Peer Mountain, a decentralized P2P ecosystem of trust, and the founder of KYC3, one of the original regtech companies in Luxembourg.\n"
  },
  {
    "link": "https://techcrunch.com/author/ingrid-lunden/",
    "name": "Ingrid Lunden",
    "workingAs": "Managing Editor, Global, TechCrunch",
    "detail": "\nIngrid is a writer and editor for TechCrunch, joining February 2012, based out of London.\nBefore TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect.\nWhen it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence)."
  },
  {
    "link": "https://techcrunch.com/author/sarah-buhr/",
    "name": "Sarah Buhr",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nI write about the wild new frontier of biotechnology (3D printed organs, one drop blood tests, or hamburgers grown in a lab? I’m your gal), also a bit of politics, gender and diversity and sometimes they put me on camera at TechCrunch so send your fun gadgets and gizmos my way.\n"
  },
  {
    "link": "https://techcrunch.com/author/sunny-dhillon/",
    "name": "Sunny Dhillon",
    "workingAs": "Contributor",
    "detail": "\nSunny Dhillon is an early-stage investor at Signia Ventures in San Francisco where he invests in retail tech, e-commerce infrastructure and logistics, alongside consumer and enterprise software startups.\n"
  },
  {
    "link": "https://techcrunch.com/author/kyle-wood/",
    "name": "Kyle Wood",
    "workingAs": "Not available",
    "detail": "\nKyle Wood is senior counsel in Perkins Coie’s Blockchain Technology \u0026 Digital Currency industry group in the Dallas office.\n"
  },
  {
    "link": "https://techcrunch.com/author/jon-evans/",
    "name": "Jon Evans",
    "workingAs": "CTO, HappyFunCorp",
    "detail": "\nJon Evans is the CTO of the engineering consultancy HappyFunCorp; the award-winning author of six novels, one graphic novel, and a book of travel writing; and TechCrunch’s weekend columnist since 2010.\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/abraham-othman/",
    "name": "Abe Othman",
    "workingAs": "Contributor",
    "detail": "\nAbe Othman is the head of data science at AngelList Venture, where he leads a small team creating the new field of quantitative venture capital. He has founded two machine-learning companies with successful exits and invested in more than a dozen seed-stage companies. He received his A.B. from Harvard in Applied Math and a Ph.D. in Computer Science from Carnegie Mellon.\n"
  },
  {
    "link": "https://techcrunch.com/author/jordan-crook/",
    "name": "Jordan Crook",
    "workingAs": "TechCrunch",
    "detail": "\nJordan Crook was the Deputy Editor of TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/jon-russell/",
    "name": "Jon Russell",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJon Russell was a reporter for TechCrunch covering all things tech in Asia, in particular the major players in China, India and Southeast Asia. Originally from the UK, he is based in Bangkok and has lived in Thailand since 2008.\n"
  },
  {
    "link": "https://techcrunch.com/author/john-biggs-2/",
    "name": "John Biggs",
    "workingAs": "Contributor, Tech4Reporters",
    "detail": "\nJohn Biggs is a writer, consultant, programmer, former East Coast Editor and current contributing writer for TechCrunch. He writes mainly about technology, cryptocurrency, security, gadgets, gear, wristwatches, and the internet. After spending his formative years as a programmer, he switched his profession and became a full-time entrepreneur andwriter. His work has appeared in the New York Times, Laptop, PC Upgrade, Surge, Gizmodo, Men’s Health, InSync, Linux Journal, Popular Science, Sync, and he has written a book called Black Hat: Misfits, Criminals, and Scammers in the Internet Age.\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/megan-rose-dickey/",
    "name": "Megan Rose Dickey",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nMegan Rose Dickey is a senior reporter at TechCrunch focused on labor, transportation, and diversity and inclusion in tech.\nShe previously spent two years at Business Insider covering tech startups focused on the shared economy, IoT and music industry.\nShe graduated from the University of Southern California in 2011 with a degree in Broadcast and Digital Journalism.\n– See more at: https://www.crunchbase.com/person/megan-rose-dickey#sthash.ir4VFt2z.dpuf\nPGP fingerprint for email is: 2FA7 6E54 4652 781A B365 BE2E FBD7 9C5F 3DAE 56BD\n"
  },
  {
    "link": "https://techcrunch.com/author/danny-crichton-2/",
    "name": "Danny Crichton",
    "workingAs": "Contributor, TechCrunch",
    "detail": "\nDanny Crichton is an investor at CRV and a former contributing writer at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/jonathan-shieber/",
    "name": "Jonathan Shieber",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJonathan was an editor at TechCrunch./p\u003e\n"
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/anthony-ha/",
    "name": "Anthony Ha",
    "workingAs": "TechCrunch",
    "detail": "\nAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech writer at Adweek, a senior editor at the tech blog VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a venture capital firm. He lives in New York City."
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/josh-constine/",
    "name": "Josh Constine",
    "workingAs": "Not available",
    "detail": "\nJosh Constine is a Principal investor and Head Of Content at venture capital fund SignalFire. He invests in early stage startups across verticals with a focus on social apps, visual communication, remote work, entertainment \u0026 media, and tech’s transformation of new sectors. Constine also creates content for SignalFire, drawing on data insights from the fund’s predictive recruiting engine Beacon and invested advisor network of 75 top tech leaders. SignalFire is currently investing from its $200 million seed fund and $300 million breakout fund, and has backed startups like Uber, Grammarly, Ro, Alchemy, and ClassDojo.\nConstine currently writes a weekly newsletter called Moving Product at https://constine.substack.com/ where he discusses big ideas facing the startup industry, the most exciting new tech products, and interviews top industry talent about the most important recent launches.\nPreviously, Constine was the Editor-At-Large for TechCrunch where he wrote over 3500 blog posts about social tech giants like Facebook and Snapchat as well as early stage startups across verticals. His work was cited on the floors of the Senate and House Of Representatives, and led to the shut down of Facebook’s Onavo market surveillance app.\nConstine was formerly the Lead Writer of Inside Facebook through its acquisition by WebMediaBrands, covering everything about the social network.\nConstine graduated from Stanford University in 2009 with a Master’s degree in Cybersociology, examining the influence of technology on social interaction. He researched the impact of privacy controls on the socialization of children, meme popularity cycles, and what influences the click through rate of links posted to Twitter. Constine also received a Bachelor of Arts degree with honors from Stanford University in 2007, with a concentration in Social Psychology \u0026 Interpersonal Processes.\nJosh Constine is an experienced public speaker, and has moderated over 190 on-stage interviews in 18 countries with leaders including Facebook CEO Mark Zuckerberg, Instagram’s founders, whistleblower Edward Snowden (via on-stage video conference), and U.S. Senator Cory Booker. He also delivers keynotes on how to pitch startups, press strategy for tech companies, and how to turn your passion into your profession. He is available to moderate panels and fireside chats, provide keynotes, and judge hackathon and pitch competitions. You can contact him at Joshsc [at] gmail .com\nConstine has been quoted by The Wall Street Journal, CNN Money, The Atlantic, BBC World Magazine, Slate, and more, plus has been featured on television on Good Morning, America, The Today Show, China Central Television, and Fox News. Constine was ranked as the #1 most cited tech journalist on prestigious news aggregator Techmeme from 2016 to 2020.\n"
  },
  {
    "link": "https://techcrunch.com/author/brooks-rainwater/",
    "name": "Brooks Rainwater",
    "workingAs": "Not available",
    "detail": "\nBrooks Rainwater is the director of the Center for City Solutions and Applied Research at the National League of Cities.\n"
  },
  {
    "link": "https://techcrunch.com/author/ronjourn/",
    "name": "Ron Miller",
    "workingAs": "Enterprise Reporter, TechCrunch",
    "detail": "\nRon Miller has been writing about the enterprise at TechCrunch since 2014.\nPreviously, he was a long-time Contributing Editor at EContent Magazine. Past regular gigs included CITEworld, DaniWeb, TechTarget, Internet Evolution and FierceContentManagement.\nDisclosures:\nRon was formerly corporate blogger for Intronis where he wrote once weekly on IT issues. He has contributed to various corporate blogs in the past including Ness, Novell and the IBM Mid-market Blogger Program."
  },
  {
    "link": "https://techcrunch.com/author/ben-dickson/",
    "name": "Ben Dickson",
    "workingAs": "Not available",
    "detail": "\nBen Dickson is a software engineer and the founder of TechTalks.\n"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/jason-rowley/",
    "name": "Jason Rowley",
    "workingAs": "Not available",
    "detail": "\nJason Rowley is a venture capital and technology reporter for Crunchbase News.\n"
  },
  {
    "link": "https://techcrunch.com/author/jordan-crook/",
    "name": "Jordan Crook",
    "workingAs": "TechCrunch",
    "detail": "\nJordan Crook was the Deputy Editor of TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/taylor-hatmaker/",
    "name": "Taylor Hatmaker",
    "workingAs": "Culture Editor, TechCrunch",
    "detail": "\nTaylor covered social media, gaming and culture at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/catherine-shu/",
    "name": "Catherine Shu",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nCatherine Shu covered startups in Asia and breaking news for TechCrunch. Her reporting has also appeared in the New York Times, the Taipei Times, Barron’s, the Wall Street Journal and the Village Voice. She studied at Sarah Lawrence College and the Columbia Graduate School of Journalism.\nDisclosures: None\n"
  },
  {
    "link": "https://techcrunch.com/author/christoffer-o-hernaes/",
    "name": "Christoffer O. Hernæs",
    "workingAs": "Not available",
    "detail": "\nChristoffer O. Hernæs is chief digital officer of Sbanken, Norway’s first digital-only bank and leading challenger bank.\n"
  },
  {
    "link": "https://techcrunch.com/author/brian-heater/",
    "name": "Brian Heater",
    "workingAs": "Hardware Editor, TechCrunch",
    "detail": "\nBrian Heater is the Hardware Editor at TechCrunch. He worked for a number of leading tech publications, including Engadget, PCMag, Laptop, and Tech Times, where he served as the Managing Editor. His writing has appeared in Spin, Wired, Playboy, Entertainment Weekly, The Onion, Boing Boing, Publishers Weekly, The Daily Beast and various other publications. He hosts the weekly Boing Boing interview podcast RiYL, has appeared as a regular NPR contributor and shares his Queens apartment with a rabbit named Juniper."
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/frederic-lardinois/",
    "name": "Frederic Lardinois",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nBefore he joined TechCrunch in 2012, he founded SiliconFilter and wrote for ReadWriteWeb (now ReadWrite). Frederic covers enterprise, cloud, developer tools, Google, Microsoft, gadgets, transportation and anything else he finds interesting. He owns just over a 50th of a bitcoin."
  },
  {
    "link": "https://techcrunch.com/author/fitz-tepper/",
    "name": "Fitz Tepper",
    "workingAs": "Not available",
    "detail": "\nFitz Tepper is a junior in the Marshall School of Business at The University of Southern California. He’s been a passionate Apple fan and developer for over 10 years, and loves covering the business-side of startups.\n"
  },
  {
    "link": "https://techcrunch.com/author/steve-ohear/",
    "name": "Steve O\u0027Hear",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nSteve O’Hear is best known as a technology journalist, currently at TechCrunch where he focuses on European startups, companies and products.\nHe first joined TechCrunch in November 2009 as Contributing Editor for TechCrunch Europe, where he worked alongside Editor Mike Butcher to help build TechCrunch’s coverage in Europe.\nIn June 2011, Steve took a break from journalism to co-found the London and Prague-based startup Beepl. In his role as CEO, he helped the company raise its first VC round, along with seeing the Question \u0026 Answer site through development, private alpha and a high profile public launch. In November 2012, Beepl was acquired by Brand Embassy.\nAlong with TechCrunch, Steve has written for numerous publications, including ZDNet (where he wrote the well-respected blog ‘The Social Web’), The Guardian, Macworld, TES, Last100 and ReadWriteWeb. He also wrote and directed the critically acclaimed Silicon Valley documentary ‘In Search of the Valley’, which was released in September 2006.\nIn 2002, Steve was made a fellow of the National Endowment for Science, Technology and the Arts. He’s also one half of ProtoBake Labs, an ‘ideas incubator’ he co-founded with Pete Harris.\nDisclaimer: Steve owns a small amount of cryptocurrency, and doesn’t generally write about crypto currencies. If and when he does, he will always disclose any potential conflict of interest.\n"
  },
  {
    "link": "https://techcrunch.com/author/samantha-stein/",
    "name": "Samantha Stein",
    "workingAs": "Not available",
    "detail": "\nSamantha Stein is the Founder of Hacktivision, the former Director of Special Projects for TechCrunch, and a Curator and Global Shaper for the World Economic Forum. Samantha’s work spans civic and social activism through technology with a focus on inclusivity to trend prediction for early-stage ventures through TechCrunch’s Startup Battlefield Competition — the world’s premiere startup competition.\n"
  },
  {
    "link": "https://techcrunch.com/author/jon-russell/",
    "name": "Jon Russell",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJon Russell was a reporter for TechCrunch covering all things tech in Asia, in particular the major players in China, India and Southeast Asia. Originally from the UK, he is based in Bangkok and has lived in Thailand since 2008.\n"
  },
  {
    "link": "https://techcrunch.com/author/john-biggs-2/",
    "name": "John Biggs",
    "workingAs": "Contributor, Tech4Reporters",
    "detail": "\nJohn Biggs is a writer, consultant, programmer, former East Coast Editor and current contributing writer for TechCrunch. He writes mainly about technology, cryptocurrency, security, gadgets, gear, wristwatches, and the internet. After spending his formative years as a programmer, he switched his profession and became a full-time entrepreneur andwriter. His work has appeared in the New York Times, Laptop, PC Upgrade, Surge, Gizmodo, Men’s Health, InSync, Linux Journal, Popular Science, Sync, and he has written a book called Black Hat: Misfits, Criminals, and Scammers in the Internet Age.\n"
  },
  {
    "link": "https://techcrunch.com/author/romain-dillet/",
    "name": "Romain Dillet",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nRomain Dillet is a Senior Reporter at TechCrunch.\nHe has written over 3,000 articles on technology and tech startups and has established himself as an influential voice on the European tech scene. He has a deep background in startups, privacy, security, fintech, blockchain, mobile, social and media.\nWith twelve years of experience at TechCrunch, he’s one of the familiar faces of the tech publication that obsessively covers Silicon Valley and the tech industry. In fact, his career started at TechCrunch when he was 21. Based in Paris, many people in the tech ecosystem consider him as the most knowledgeable tech journalist in town.\nRomain likes to spot important startups before anyone else. He was the first person to cover N26, Revolut and DigitalOcean. He has written scoops on large acquisitions from Apple, Microsoft and Snap.\nWhen he’s not writing, Romain is also a developer — he understands how the tech behind the tech works. He also has a deep historical knowledge of the computer industry for the past 50 years. He knows how to connect the dots between innovations and the effect on the fabric of our society.\nRomain graduated from Emlyon Business School, a leading French business school specialized in entrepreneurship. He has helped several non-profit organizations, such as StartHer, an organization that promotes education and empowerment of women in technology, and Techfugees, an organization that empowers displaced people with technology."
  },
  {
    "link": "https://techcrunch.com/author/natasha-lomas/",
    "name": "Natasha Lomas",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nNatasha is a senior reporter for TechCrunch, joining September 2012, based in Europe. She joined TC after a stint reviewing smartphones for CNET UK and, prior to that, more than five years covering business technology for silicon.com (now folded into TechRepublic), where she focused on mobile and wireless, telecoms \u0026 networking, and IT skills issues. She has also freelanced for organisations including The Guardian and the BBC. Natasha holds a First Class degree in English from Cambridge University, and an MA in journalism from Goldsmiths College, University of London."
  },
  {
    "link": "https://techcrunch.com/author/fitz-tepper/",
    "name": "Fitz Tepper",
    "workingAs": "Not available",
    "detail": "\nFitz Tepper is a junior in the Marshall School of Business at The University of Southern California. He’s been a passionate Apple fan and developer for over 10 years, and loves covering the business-side of startups.\n"
  },
  {
    "link": "https://techcrunch.com/author/connie-loizos/",
    "name": "Connie Loizos",
    "workingAs": "Editor in Chief \u0026 General Manager, TechCrunch",
    "detail": "\nLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch."
  },
  {
    "link": "https://techcrunch.com/author/taylor-hatmaker/",
    "name": "Taylor Hatmaker",
    "workingAs": "Culture Editor, TechCrunch",
    "detail": "\nTaylor covered social media, gaming and culture at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/jason-rowley/",
    "name": "Jason Rowley",
    "workingAs": "Not available",
    "detail": "\nJason Rowley is a venture capital and technology reporter for Crunchbase News.\n"
  },
  {
    "link": "https://techcrunch.com/author/devin-coldewey/",
    "name": "Devin Coldewey",
    "workingAs": "Writer \u0026 Photographer, TechCrunch",
    "detail": "\nDevin Coldewey is a Seattle-based writer and photographer. He first wrote for TechCrunch in 2007.\nHis personal website is coldewey.cc."
  },
  {
    "link": "https://techcrunch.com/author/danny-crichton-2/",
    "name": "Danny Crichton",
    "workingAs": "Contributor, TechCrunch",
    "detail": "\nDanny Crichton is an investor at CRV and a former contributing writer at TechCrunch.\n"
  },
  {
    "link": "https://techcrunch.com/author/josh-constine/",
    "name": "Josh Constine",
    "workingAs": "Not available",
    "detail": "\nJosh Constine is a Principal investor and Head Of Content at venture capital fund SignalFire. He invests in early stage startups across verticals with a focus on social apps, visual communication, remote work, entertainment \u0026 media, and tech’s transformation of new sectors. Constine also creates content for SignalFire, drawing on data insights from the fund’s predictive recruiting engine Beacon and invested advisor network of 75 top tech leaders. SignalFire is currently investing from its $200 million seed fund and $300 million breakout fund, and has backed startups like Uber, Grammarly, Ro, Alchemy, and ClassDojo.\nConstine currently writes a weekly newsletter called Moving Product at https://constine.substack.com/ where he discusses big ideas facing the startup industry, the most exciting new tech products, and interviews top industry talent about the most important recent launches.\nPreviously, Constine was the Editor-At-Large for TechCrunch where he wrote over 3500 blog posts about social tech giants like Facebook and Snapchat as well as early stage startups across verticals. His work was cited on the floors of the Senate and House Of Representatives, and led to the shut down of Facebook’s Onavo market surveillance app.\nConstine was formerly the Lead Writer of Inside Facebook through its acquisition by WebMediaBrands, covering everything about the social network.\nConstine graduated from Stanford University in 2009 with a Master’s degree in Cybersociology, examining the influence of technology on social interaction. He researched the impact of privacy controls on the socialization of children, meme popularity cycles, and what influences the click through rate of links posted to Twitter. Constine also received a Bachelor of Arts degree with honors from Stanford University in 2007, with a concentration in Social Psychology \u0026 Interpersonal Processes.\nJosh Constine is an experienced public speaker, and has moderated over 190 on-stage interviews in 18 countries with leaders including Facebook CEO Mark Zuckerberg, Instagram’s founders, whistleblower Edward Snowden (via on-stage video conference), and U.S. Senator Cory Booker. He also delivers keynotes on how to pitch startups, press strategy for tech companies, and how to turn your passion into your profession. He is available to moderate panels and fireside chats, provide keynotes, and judge hackathon and pitch competitions. You can contact him at Joshsc [at] gmail .com\nConstine has been quoted by The Wall Street Journal, CNN Money, The Atlantic, BBC World Magazine, Slate, and more, plus has been featured on television on Good Morning, America, The Today Show, China Central Television, and Fox News. Constine was ranked as the #1 most cited tech journalist on prestigious news aggregator Techmeme from 2016 to 2020.\n"
  },
  {
    "link": "https://techcrunch.com/author/anthony-ha/",
    "name": "Anthony Ha",
    "workingAs": "TechCrunch",
    "detail": "\nAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech writer at Adweek, a senior editor at the tech blog VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a venture capital firm. He lives in New York City."
  },
  {
    "link": "https://techcrunch.com/author/darrell-etherington/",
    "name": "Darrell Etherington",
    "workingAs": "Editor at Large, TechCrunch",
    "detail": "\nWriter covering space, science and health tech. Formerly covering automotive and mobility tech, and previously an employee of Apple and also of Shopify.\n"
  },
  {
    "link": "https://techcrunch.com/author/lucas-matney/",
    "name": "Lucas Matney",
    "workingAs": "TechCrunch",
    "detail": "\nLucas Matney was a senior editor at TechCrunch based in San Francisco.\n"
  },
  {
    "link": "https://techcrunch.com/author/andy-vitus/",
    "name": "Andy Vitus",
    "workingAs": "Not available",
    "detail": "\nAndy Vitus is a partner at Scale Venture Partners.\n"
  },
  {
    "link": "https://techcrunch.com/author/sarah-buhr/",
    "name": "Sarah Buhr",
    "workingAs": "Reporter, TechCrunch",
    "detail": "\nI write about the wild new frontier of biotechnology (3D printed organs, one drop blood tests, or hamburgers grown in a lab? I’m your gal), also a bit of politics, gender and diversity and sometimes they put me on camera at TechCrunch so send your fun gadgets and gizmos my way.\n"
  },
  {
    "link": "https://techcrunch.com/author/justin-mauldin/",
    "name": "Justin Mauldin",
    "workingAs": "Not available",
    "detail": "\nJustin Mauldin is the founder of Salient PR and an investor in cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/ouriel-oharon/",
    "name": "Ouriel Ohayon",
    "workingAs": "Not available",
    "detail": "\nOuriel Ohayon, a former TechCrunch staffer, is the chief executive of Codename Django focused on custody and cryptocurrency.\n"
  },
  {
    "link": "https://techcrunch.com/author/megan-rose-dickey/",
    "name": "Megan Rose Dickey",
    "workingAs": "Senior Reporter, TechCrunch",
    "detail": "\nMegan Rose Dickey is a senior reporter at TechCrunch focused on labor, transportation, and diversity and inclusion in tech.\nShe previously spent two years at Business Insider covering tech startups focused on the shared economy, IoT and music industry.\nShe graduated from the University of Southern California in 2011 with a degree in Broadcast and Digital Journalism.\n– See more at: https://www.crunchbase.com/person/megan-rose-dickey#sthash.ir4VFt2z.dpuf\nPGP fingerprint for email is: 2FA7 6E54 4652 781A B365 BE2E FBD7 9C5F 3DAE 56BD\n"
  },
  {
    "link": "https://techcrunch.com/author/frederic-lardinois/",
    "name": "Frederic Lardinois",
    "workingAs": "Editor, TechCrunch",
    "detail": "\nBefore he joined TechCrunch in 2012, he founded SiliconFilter and wrote for ReadWriteWeb (now ReadWrite). Frederic covers enterprise, cloud, developer tools, Google, Microsoft, gadgets, transportation and anything else he finds interesting. He owns just over a 50th of a bitcoin."
  },
  {
    "link": "https://techcrunch.com/author/jonathan-shieber/",
    "name": "Jonathan Shieber",
    "workingAs": "Writer, TechCrunch",
    "detail": "\nJonathan was an editor at TechCrunch./p\u003e\n"
  },
  {
    "link": "https://techcrunch.com/author/matt-burns/",
    "name": "Matt Burns",
    "workingAs": "Senior Editor, TechCrunch",
    "detail": "\nMatt is a Managing Editor at TechCrunch.\nHe started at TechCrunch as a freelance writer in 2008 and moved up the ranks to become the Managing Editor in early 2017. Born and raised in the heart of the automotive world, he has a special place in his heart for mobility startups and gadgets.\nAt TechCrunch he manages the editorial side of the company’s events including TechCrunch Disrupt, TechCrunch Sessions and the company’s various worldwide events. Previously he was a freelance writer at Engadget and EngadgetHD where he hosted podcasts until he was removed from that role after saying a swear word. He’s very sorry and promises it won’t happen again.\nHis passions include emails, run-on sentences and following through with action items developed during a conference call. And woodwork.\n"
  },
  {
    "link": "https://techcrunch.com/author/mike-butcher/",
    "name": "Mike Butcher",
    "workingAs": "Editor At Large, TechCrunch",
    "detail": "\nMike Butcher (M.B.E.) is Editor-at-large of TechCrunch. He has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder ThePathfounder.com newsletter; TheEuropas.com (the Annual European Tech Startup Conference \u0026 Awards for 12 years); and the non-profits Techfugees.com, TechVets.co, and Coadec.com. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism."
  },
  {
    "link": "https://techcrunch.com/author/faisal-khan/",
    "name": "Faisal Khan",
    "workingAs": "Not available",
    "detail": "\nFaisal supports strategy and business development for the Dubai office of ConsenSys, an Ethereum venture production studio.\n"
  },
  {
    "link": "https://techcrunch.com/author/deep-patel/",
    "name": "Deep Patel",
    "workingAs": "Not available",
    "detail": "\nDeep Patel is a serial entrepreneur, marketer and the author of A Paperboy’s Fable: The 11 Principles of Success.\n"
  }
]

