[
  {
    "link": "https://www.digitaltrends.com/users/zislam/",
    "name": "Zak Islam",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Zak Islam was a freelance writer at Digital Trends covering the latest news in the technology world, particularly the computing field. A fan of anything pertaining to tech from the latest gadgets to the newest graphics cards and CPUs, Zak has also written for Tom\u0027s Hardware."
  },
  {
    "link": "https://www.digitaltrends.com/users/cristinamariealexandergmail-com/",
    "name": "Cristina Alexander",
    "workingAs": "Gaming/Mobile Writer",
    "detail": "Cristina Alexander has been writing since 2014, from opining about pop culture on her personal blog in college to reporting on video games, entertainment, Internet culture, and more recently, mobile technology as a freelance journalist. Her work has appeared on TheGamer, Gamepur, SlashGear, Giant Freakin\u0027 Robot, Twinfinite, KeenGamer, and Mega Visions. Cristina used to be an Android girl, now she\u0027s an Apple woman with no possible plans to turn back anytime soon. She resides in sunny South Florida."
  },
  {
    "link": "https://www.digitaltrends.com/users/mwhite/",
    "name": "Monica J. White",
    "workingAs": "Computing Writer",
    "detail": "Monica is a UK-based freelance writer and self-proclaimed geek. A firm believer in the \"PC building is just like expensive Legos\" philosophy, Monica loves to play around with different builds - if not in reality, then at least on one of her several wishlists. If she\u0027s not currently neck-deep in Google Docs or elbow-deep in her PC case, she\u0027s most likely spending the day gaming or hanging out with her dog."
  },
  {
    "link": "https://www.digitaltrends.com/users/mgebel/",
    "name": "Meira Gebel",
    "workingAs": "",
    "detail": "Meira Gebel is a freelance reporter based in Portland. She writes about tech, social media, and internet culture for Digital Trends. Her work has been featured in Business Insider, USA Today, Willamette Week, Detroit Free Press, San Francisco Business Times, and more. Got a tip? Or just want to chat about the Kardashians? Twitter DMs are always open."
  },
  {
    "link": "https://www.digitaltrends.com/users/caleb-clark/",
    "name": "Caleb Clark",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Caleb Clark is a full-time writer that primarily covers consumer tech and gaming. He also writes frequently on Medium about books and movies. He spends his free time playing Warhammer, raising nerdy children, and writing his first novel."
  },
  {
    "link": "https://www.digitaltrends.com/users/sagarwal/",
    "name": "Shubham Agarwal",
    "workingAs": "Journalist",
    "detail": "Shubham Agarwal is a freelance technology journalist from Ahmedabad, India. His work has previously appeared in Firstpost, HuffPost India, and Tomsguide."
  },
  {
    "link": "https://www.digitaltrends.com/users/emorrow/",
    "name": "Emily Morrow",
    "workingAs": "",
    "detail": "Emily Morrow is a games journalist and narrative designer who has written for a variety of online publications. If she’s not playing games, writing about games, or thinking about games, she’s probably asleep. She also likes chasing thunderstorms, reading, and petting all the cats. You can read more of her ramblings on Twitter @thepokeflute."
  },
  {
    "link": "https://www.digitaltrends.com/users/bkenney/",
    "name": "Briley Kenney",
    "workingAs": "Senior SEO Copywriter",
    "detail": "Briley has been writing about consumer electronics and technology for over a decade. When he\u0027s not writing about deals for Digital Trends, he\u0027s writing how-to content, and guides for Lifewire, Ideaing, and several other online publications. He\u0027s also a ghostwriter for more than one confidential SEO marketing agency. In his downtime, he\u0027s either spending time with his family, playing games, or enjoying a good ol\u0027 stogie."
  },
  {
    "link": "https://www.digitaltrends.com/users/giovannicolantonio/",
    "name": "Giovanni Colantonio",
    "workingAs": "Section Editor, Gaming",
    "detail": "Giovanni is a writer and video producer focusing on happenings in the video game industry. He has contributed stories to Inverse, Fanbyte, The Inventory, and more. He was previously a segment producer on Polygon\u0027s daily gaming show Speedrun and he currently hosts the Left Trigger Right Trigger podcast. Four Tetris 99 wins, and counting."
  },
  {
    "link": "https://www.digitaltrends.com/users/alexblake/",
    "name": "Alex Blake",
    "workingAs": "Computing Writer",
    "detail": "In ancient times, people like Alex would have been shunned for their nerdy ways and strange opinions on cheese. Today, he fits right in at Digital Trends, where he writes about all things Apple, from the latest devices to ongoing developments and everything in between. He’s loved tech ever since he realized video games were about as fun as real people, but easier to manage and much cheaper."
  },
  {
    "link": "https://www.digitaltrends.com/users/mallison/",
    "name": "Michael Allison",
    "workingAs": "Mobile News Writer",
    "detail": "A UK-based tech journalist for Digital Trends, helping keep track and make sense of the fast-paced world of tech with a primary focus on mobile phones, tablets, and wearables."
  },
  {
    "link": "https://www.digitaltrends.com/users/dmatthews/",
    "name": "David Matthews",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "David is a freelance journalist based just outside of Washington D.C. specializing in consumer technology and gaming. He has over five years of experience with bylines in major publications such as Digital Trends, TechSpot, and IGN. Outside of writing, David enjoys playing FPS and action RPGs, reading, and spending time with family."
  },
  {
    "link": "https://www.digitaltrends.com/users/jacob-roach/",
    "name": "Jacob Roach",
    "workingAs": "Lead Reporter, PC Hardware",
    "detail": "Jacob Roach is the lead reporter for PC hardware at Digital Trends. In addition to covering the latest PC components, from graphics cards to processors to PC cases, Jacob also leads the ReSpec column and newsletter that covers the intersection of PC hardware and gaming. If it\u0027s something you can plug into a gaming PC, there\u0027s a good chance Jacob has used it."
  },
  {
    "link": "https://www.digitaltrends.com/users/cnguyen/",
    "name": "Chuong Nguyen",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Silicon Valley-based technology reporter and Giants baseball fan who splits his time between Northern California and Southern California. Chuong enjoys all things gadget-related and his passions include traveling, photography, gardening, ocean kayaking, and hiking. Be sure to reach out on Twitter if you\u0027re in the San Francisco Bay Area and have cool technology to pitch, have new music recommendations, or if you have any suggestions for cool restaurants or hiking spots!"
  },
  {
    "link": "https://www.digitaltrends.com/users/jonmartindale/",
    "name": "Jon Martindale",
    "workingAs": "Computing Coordinator",
    "detail": "Jon Martindale is the Evergreen Coordinator for Computing, overseeing a team of writers addressing all the latest how to guides, best-of lists, and explainers to help everyone understand the hottest new hardware and software in desktops, laptops, and on the web."
  },
  {
    "link": "https://www.digitaltrends.com/users/ldormehl/",
    "name": "Luke Dormehl",
    "workingAs": "Contributor",
    "detail": "I\u0027m a UK-based tech writer covering Cool Tech at Digital Trends. I\u0027ve also written for Fast Company, Wired, the Guardian, Politico and others. I\u0027m the author of Thinking Machines and The Formula: How Algorithms Solve All Our Problems... And Create More."
  },
  {
    "link": "https://www.digitaltrends.com/users/simon-chandler/",
    "name": "Simon Chandler",
    "workingAs": "Mobile Writer",
    "detail": "Simon Chandler is a journalist based in London, UK. He covers technology and finance, contributing to such titles as Digital Trends, Forbes, Business Insider, InsideBitcoins, Cryptonews.com, and CryptoVantage. He has also contributed to Wired, TechCrunch, TechRadar, the Daily Dot, the Verge, Cointelegraph, CCN.com, the New Internationalist, Bandcamp, the Sun, and numerous others."
  },
  {
    "link": "https://www.digitaltrends.com/users/abacchus/",
    "name": "Arif Bacchus",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Arif Bacchus is a native New Yorker and a fan of all things technology. Arif works as a freelance writer at Digital Trends and OnMSFT, covering Microsoft, Surface, Windows, macOS, and Chrome OS news and rumors. He also writes the occasional laptop review and how-to guide. Arif is a huge Microsoft fan and has as many Windows PCs as he has fingers. When not writing or playing on PCs, you can find him on Twitter where he\u0027s always making new friends and engaged with the tech community."
  },
  {
    "link": "https://www.digitaltrends.com/users/amatyus/",
    "name": "Allison Matyus",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Allison Matyus is a general news reporter at Digital Trends. She covers any and all tech news, including issues around social media and data privacy. Allison was previously a freelance journalist for the Chicago Tribune Media Group covering local news in Chicago’s South Suburbs. She’s also written for The Idea Forge, where she covered the city\u0027s tech industry and startup landscape. Allison spent nearly two years as a Senior Reporter at Chicago’s oldest neighborhood newspaper, The Hyde Park Herald, where she covered politics, education, real estate, retail, and development. Living in Chicago, Allison has her own personal wellness blog and loves to travel to national parks."
  },
  {
    "link": "https://www.digitaltrends.com/users/zjones/",
    "name": "Zoe Christen Jones",
    "workingAs": "",
    "detail": "Zoe Christen Jones is a breaking news reporter. She covers news, digital culture, tech, and more."
  },
  {
    "link": "https://www.digitaltrends.com/users/trevor_mogg/",
    "name": "Trevor Mogg",
    "workingAs": "Contributing Editor",
    "detail": "Not so many moons ago, Trevor moved from one tea-loving island nation that drives on the left (Britain) to another (Japan). As far as electronics are concerned, he\u0027s in the right place, with the East Asian country continuing to produce a plethora of gadgets and gizmos for tech addicts around the world. When not writing for Digital Trends, Trevor can be found out and about taking far too many photos, or in front of his computer trying to sort them all out."
  },
  {
    "link": "https://www.digitaltrends.com/users/hgrigonis/",
    "name": "Hillary K. Grigonis",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Hillary never planned on becoming a photographer—and then she was handed a camera at her first writing job and she\u0027s been writing with one hand and shooting with the other ever since. At Hillary K Photography, she works as a wedding and portrait photographer. When she\u0027s not writing or shooting, she\u0027s trying to keep up with two kids, collecting film cameras, unplugging outdoors, reading or traveling."
  },
  {
    "link": "https://www.digitaltrends.com/users/msampathkumar/",
    "name": "Mythili Sampathkumar",
    "workingAs": "",
    "detail": "Mythili is a freelance journalist based in New York. When not reporting about politics, foreign policy, entertainment, and climate change, she is reading during a subway delay and attempting to be artistic."
  },
  {
    "link": "https://www.digitaltrends.com/users/kparrish/",
    "name": "Kevin Parrish",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Kevin started taking PCs apart in the 90s when Quake was on the way and his PC lacked the required components. Since then, he’s loved all things PC-related and cool gadgets ranging from the New Nintendo 3DS to Android tablets. At Digital Trends, he\u0027s written everything about computers, from how-to content on Windows and Macs to reviews of the latest laptops from HP, Dell, Lenovo, and more. He began his online writing career cranking out news, reviews, and previews based on the Sega Dreamcast console."
  },
  {
    "link": "https://www.digitaltrends.com/users/simonhill/",
    "name": "Simon Hill",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Simon Hill is an experienced technology journalist and editor who loves all things tech. He is currently the Associate Mobile Editor at Digital Trends. He has spent more than a decade writing about smartphones, wearables, tablets, software, computing, videogames, and robots all over the internet for Tech Radar, Android Authority, USA Today, VentureBeat, Deal News, and many other places. His work has also appeared on Yahoo! Tech, CNN, Fox News, Lifehacker, and Christian Science Monitor. He also spent several years working in the games industry as a game designer and producer. He lives in Scotland with his wife and two kids."
  },
  {
    "link": "https://www.digitaltrends.com/users/gtorbet/",
    "name": "Georgina Torbet",
    "workingAs": "Space Writer",
    "detail": "Georgina is the Digital Trends space writer, covering human space exploration, planetary science, and cosmology. She specializes in current and future exploration of Mars. She has previously written about science, technology, and security topics for websites like SlashGear, Engadget, and Futurism. She has a master\u0027s degree in neuroscience and a PhD in psychology."
  },
  {
    "link": "https://www.digitaltrends.com/users/wnicol/",
    "name": "Will Nicol",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Will Nicol is a Senior Writer at Digital Trends. He covers a variety of subjects, particularly emerging technologies, movies and TV, and more. He has keen interest in technologies that can transform society, and also has hot takes about Game of Thrones. When not working, Will enjoys practicing guitar, learning Spanish, and spending too much money building Magic: The Gathering decks."
  },
  {
    "link": "https://www.digitaltrends.com/users/delooper/",
    "name": "Christian de Looper",
    "workingAs": "Contributor",
    "detail": "Christian’s interest in technology began as a child in Australia, when he stumbled upon a computer at a garage sale that he knew didn’t work, but he bought anyway. Now living in California, he covers the world of mobile technology for Digital Trends, from the latest Apple iPhone and iPad to the vast array of Android smartphones on the market -- and the various apps and services. Apart from writing about tech, Christian spends his time in the music studio as a producer."
  },
  {
    "link": "https://www.digitaltrends.com/users/mkatz/",
    "name": "Mathew Katz",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Mathew is a news editor at Digital Trends, specializing in covering all kinds of tech news — from video games to policy. He makes sure Digital Trends keeps you up-to-date with the latest developments on how tech affects your life and how government and businesses impact how you use technology."
  },
  {
    "link": "https://www.digitaltrends.com/users/eprice/",
    "name": "Emily Price",
    "workingAs": "",
    "detail": "Emily is a freelance writer based in San Francisco. Her book \"Productivity Hacks: 500+ Easy Ways to Accomplish More at Work--That Actually Work!\" was published in December 2018 by Simon and Schuster/Adams Media."
  },
  {
    "link": "https://www.digitaltrends.com/users/jterrasi/",
    "name": "Jonathan Terrasi",
    "workingAs": "",
    "detail": "Jonathan has studiously followed trends in technology, particularly in information security and digital privacy, since 2014 when he began teaching himself and developing proficiency in running Linux systems and deploying encryption."
  },
  {
    "link": "https://www.digitaltrends.com/users/twerkhoven/",
    "name": "Todd Werkhoven",
    "workingAs": "",
    "detail": "Todd Werkhoven\u0027s work can be read at numerous publications and he co-authored a personal finance book called \"Zombie Economics\" through Penguin Publishing. He has over 20 years of copywriting experience for industries ranging from natural foods products to high-end electronics and technology. Outside of writing, Todd works with children with special needs, and is usually podcasting for shows like \"Portland at the Movies\" and \"The Mark and Toddcast.\""
  },
  {
    "link": "https://www.digitaltrends.com/users/amamiit/",
    "name": "Aaron Mamiit",
    "workingAs": "Contributor",
    "detail": "Aaron received a NES and a copy of Super Mario Bros. for Christmas when he was 4 years old, and he has been fascinated with tech ever since. A gamer at heart, Aaron believes that while the tech industry is often dealing with side quests and boss fights, it always remains on track with the mission to save the world."
  },
  {
    "link": "https://www.digitaltrends.com/users/adellinger/",
    "name": "AJ Dellinger",
    "workingAs": "Contributor",
    "detail": "AJ Dellinger is a freelance reporter from Madison, Wisconsin with an affinity for all things tech. He has been published by Gizmodo, Newsweek, International Business Times, the Daily Dot, and many others."
  },
  {
    "link": "Not available",
    "name": "Not available",
    "workingAs": "Not available",
    "detail": "Not available"
  },
  {
    "link": "https://www.digitaltrends.com/users/ageorge/",
    "name": "Anita George",
    "workingAs": "Computing Writer",
    "detail": "Anita has been a technology reporter since 2013 and currently writes for the Computing section at Digital Trends. She began covering science and technology during an editorial internship at Paste Magazine. Anita has written a wide variety of features, reviews, how-tos and lists about the latest gadgets, apps and other technological innovations. In addition to her published work, Anita also developed technology-themed educational programming for her local community; which involved topics such as 3D printing and simple robotics (specifically Lego WeDos and Mindstorms)."
  },
  {
    "link": "https://www.digitaltrends.com/users/bbarbee/",
    "name": "Brie Barbee",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Brie is a writer from Portland, Oregon. She received a bachelor\u0027s degree from Portland State University in 2016, where she studied English and German. When she isn\u0027t writing about tech or pop culture, Brie enjoys reading, writing short stories, watching TV, crocheting, and snuggling with her two cats, Luna and Tally."
  },
  {
    "link": "https://www.digitaltrends.com/users/dtstaff/",
    "name": "Digital Trends Staff",
    "workingAs": "",
    "detail": "Digital Trends has a simple mission: to help readers easily understand how tech affects the way they live. We are your authoritative guide to the world around us. We love, live and breathe tech so that we can explain it to you simply and clearly."
  },
  {
    "link": "https://www.digitaltrends.com/users/simoncohen/",
    "name": "Simon Cohen",
    "workingAs": "Contributing Editor, A/V",
    "detail": "Simon Cohen covers a variety of consumer technologies, but has a special interest in audio and video products, like spatial audio, whole-home music systems, wireless earbuds and headphones, 4K HDR TVs, and soundbars. He has written for Ozy.com, Mobilesyrup, Driving.ca, and VentureBeat, and appeared as a guest tech expert on international TV and radio programs, including BBC Radio, CTV News Channel, and CBC Radio. He is currently a full-time contributor to Digital Trends\u0027 Audio/Video section."
  },
  {
    "link": "https://www.digitaltrends.com/users/kcoomes/",
    "name": "Kailla Coomes",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Kailla is a staff writer from Portland, Ore. She studied Journalism at the University of Oregon and graduated in 2014. In her free time, Kailla watches reruns of \u0027The Office,\u0027 attempts to teach herself bass guitar, and listens to true-crime podcasts. When she is not writing about tech, Kailla likes to write short stories and poetry."
  },
  {
    "link": "https://www.digitaltrends.com/users/andy_boxall/",
    "name": "Andy Boxall",
    "workingAs": "Senior Mobile Writer",
    "detail": "Andy is a Senior Writer at Digital Trends, where he concentrates on mobile technology, a subject he has written about for almost a decade. During that time he has seen the evolution from 2G to 5G, reviewed dozens of smartphones, worn dozens of smartwatches (not at the same time), and visited many manufacturers and events all over the world. A multi-year veteran of Mobile World Congress, CES, IFA, and Baselworld trade shows, Andy always has a strong opinion on the mobile industry, and is excited about its future."
  },
  {
    "link": "https://www.digitaltrends.com/users/tkoch/",
    "name": "Tamir Koch",
    "workingAs": "",
    "detail": "Tamir Koch is President of eMusic, a digital entertainment pioneer and 20-year champion of independent artists and labels. Today he\u0027s passionate about the power of Blockchain to fix what\u0027s broken in the music industry."
  },
  {
    "link": "https://www.digitaltrends.com/users/ebrackett/",
    "name": "Eric Brackett",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Not available"
  },
  {
    "link": "https://www.digitaltrends.com/users/ggurwin/",
    "name": "Gabe Gurwin",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Gabe Gurwin has been playing games since 1997, beginning with the N64 and the Super Nintendo. He began his journalism career back in 2010 while still in high school, and subsequently graduated summa cum laude from Ohio University\u0027s E.W. Scripps School of Journalism in 2016."
  },
  {
    "link": "https://www.digitaltrends.com/users/gburgett/",
    "name": "Gannon Burgett",
    "workingAs": "Editor",
    "detail": "Not available"
  },
  {
    "link": "https://www.digitaltrends.com/users/patrickdaniels/",
    "name": "Forrest Daniels",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "As a young woman Forrest discovered her passion for technology and art through her family\u0027s monstrous collection of goofy 90s sci-fi movies. As she grew, so did the technology around her and the desire to know and use it. Today she spends her time dabbling in software development and 3D printing."
  },
  {
    "link": "https://www.digitaltrends.com/users/stephen_edelstein/",
    "name": "Stephen Edelstein",
    "workingAs": "Contributing Editor",
    "detail": "Stephen is a freelance automotive journalist covering all things cars. He likes anything with four wheels, from classic cars to modern Tesla electric cars, and everything in between. Besides contributing to the cars section at Digital Trends, Stephen has bylines at Green Car Reports, Motor Authority, and CarGurus."
  },
  {
    "link": "https://www.digitaltrends.com/users/llarsen/",
    "name": "Luke Larsen",
    "workingAs": "Senior Editor, Computing",
    "detail": "Luke Larsen is a Senior Editor at Digital Trends and manages all content covering laptops, monitors, PC hardware, and everything else that plugs into a computer. Luke joined Digital Trends in 2017 as a native Portlander, happy to join a media company that called his city home. His obsession with technology is in observing the ebb and flow of how technological advancement and product design intersects with our day-to-day experience of it. From digging into the minute details to stepping back and seeing the wider trends, Luke revels in telling stories with tech."
  },
  {
    "link": "https://www.digitaltrends.com/users/edoswald/",
    "name": "Ed Oswald",
    "workingAs": "Contributor",
    "detail": "For fifteen years, Ed has written about the latest and greatest in gadgets and technology trends. At Digital Trends, he\u0027s turned his focus to helping readers find the best deals on the web, as well as emerging tech and science news. His book, Weather Watch: An Introduction to America\u0027s Weather and Climate, is now available on Amazon, and runs two blogs on weather stations and smart home gadgets."
  },
  {
    "link": "https://www.digitaltrends.com/users/kraigbecker/",
    "name": "Kraig Becker",
    "workingAs": "Contributor",
    "detail": "Kraig Becker is a freelance outdoor writer who loves to hike, camp, mountain bike, trail run, paddle, or just about any other activity that gets him outside. An avid adventure traveler and self-confessed gadget-nerd, he believes that technology can play a crucial role in your enjoyment of the outdoors."
  },
  {
    "link": "https://www.digitaltrends.com/users/jwagner/",
    "name": "Jayce Wagner",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "A staff writer for the Computing section, Jayce covers a little bit of everything -- hardware, gaming, and occasionally VR."
  },
  {
    "link": "https://www.digitaltrends.com/users/rcavanaugh/",
    "name": "Rachel Cavanaugh",
    "workingAs": "Contributor",
    "detail": "Rachel discovered outdoor recreation in ’98 when she stumbled into a river town one summer and left a raft guide 3 months later. She worked at ski resorts and snowboard shops before launching her career as a journalist which has included writing for print newspapers, magazines and various online publications."
  },
  {
    "link": "https://www.digitaltrends.com/users/rglon/",
    "name": "Ronan Glon",
    "workingAs": "Contributor",
    "detail": "Ronan Glon is an American automotive and tech journalist based in southern France. As a long-time contributor to Digital Trends, his job is to bridge the gap between cars and tech, while helping consumers and enthusiasts alike navigate these two increasingly intertwined worlds. He travels extensively and restlessly to get the inside scoop on horsepower, infotainment, or both."
  },
  {
    "link": "https://www.digitaltrends.com/users/drew_prindle/",
    "name": "Drew Prindle",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Drew Prindle is an award-winning writer, editor, and storyteller who currently serves as Senior Features Editor for Digital Trends. His work covers a broad range of topics, but generally leans toward science, emerging technology, and the future. He\u0027s also technically a cyborg, and has been living with microchips in his hands since 2016."
  },
  {
    "link": "https://www.digitaltrends.com/users/billroberson/",
    "name": "Bill Roberson",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "I focus on producing Digital Trends\u0027 \u0027DT Daily\u0027 video news program along with photographing items we get in for review. I also personally review various tech items - and the occasional motorcycle. Follow me on Twitter: @BillRobersonDT"
  },
  {
    "link": "https://www.digitaltrends.com/users/mattsmith/",
    "name": "Matthew S. Smith",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Matthew S. Smith is the former Lead Editor, Reviews at Digital Trends. He previously guided the Products Team, which dives deep into evaluating laptops, smartphones, televisions, headphones, and much more. In addition to more than 10 years of experience in tech journalism, Matt has appeared in hundreds of videos (both live and recorded) and has interviewed executives from numerous companies including AMD, IBM, and Intel."
  },
  {
    "link": "https://www.digitaltrends.com/users/bradjones/",
    "name": "Brad Jones",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Brad is an English-born writer currently splitting his time between Edinburgh and Pennsylvania. You can find him on Twitter under the handle @beardjones"
  },
  {
    "link": "https://www.digitaltrends.com/users/knelsonjr/",
    "name": "Keith Nelson Jr.",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Keith Nelson Jr is a music/tech journalist making big pictures by connecting dots. Born and raised in Brooklyn, NY he graduated from Syracuse University with a Bachelor\u0027s Degree in English \u0026 Textual Studies. Keith keeps a critical eye on all transgressions in the music technology field."
  },
  {
    "link": "https://www.digitaltrends.com/users/markcoppock/",
    "name": "Mark Coppock",
    "workingAs": "Computing Writer",
    "detail": "Mark has been a geek since MS-DOS gave way to Windows and the PalmPilot was a thing. He’s translated his love for technology into a marketing, consulting, and freelance writing career aimed at helping people use technology to enhance their lives. At Digital Trends, he reviews laptops and desktops, including the latest from HP, Dell, Lenovo, Apple, and more, and writes news and easy to understand how-to articles about the computing industry as a whole."
  },
  {
    "link": "https://www.digitaltrends.com/users/lucascoll/",
    "name": "Lucas Coll",
    "workingAs": "Deals and News Writer",
    "detail": "Lucas Coll has been a freelance writer for almost a decade and has penned articles on tech, video games, travel, cars, and men’s lifestyle topics. He’s held a special interest in computers and consumer technology ever since his mother brought home a Nintendo Entertainment System when he was four years old (a decision she regrets to this day), and he has written everything from news articles and deal roundups for laptops, Apple gadgets, smartphones, smartwatches, and pretty much anything else that uses electricity. When he’s not rounding up tech deals for Digital Trends or covering upcoming UFC fights for The Manual, Lucas can usually be found in his Hobbit hole reading, gaming, smoking a pipe, and messing about with computers."
  },
  {
    "link": "https://www.digitaltrends.com/users/markaustin/",
    "name": "Mark Austin",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Mark’s first encounter with high-tech was a TRS-80. He spent 20 years working for Nintendo and Xbox as a writer and corporate shill. He sucks at shooters and much prefers playing relaxing city builders and management sims."
  },
  {
    "link": "https://www.digitaltrends.com/users/mjansen/",
    "name": "Mark Jansen",
    "workingAs": "Contributor",
    "detail": "Mark Jansen is an avid follower of everything that beeps, bloops, or makes pretty lights. He has a degree in Ancient \u0026 Medieval History, which obviously makes him a shoo-in to write about technology for a living. He currently contributes to the Mobile section on Digital Trends, with a particular emphasis and expertise on exploring the weirder side of smartphones, from tiny rugged phones to massive gaming phones. You\u0027ll most often find him seeking out leaks and rumors on upcoming devices, and playing with a variety of new apps for both Android and iOS."
  },
  {
    "link": "https://www.digitaltrends.com/users/dmathies/",
    "name": "Daven Mathies",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Daven is a contributing writer to the photography section. He has been with Digital Trends since 2016 and has been writing about photography and tech for over a decade. He originally began writing at a young age for no other reason than to teach himself how to type, later taking up photography to learn how cameras worked. His love for the tech eventually turned into a passion for the crafts facilitated by it, leading him to pursue a degree in film and video production. He now moonlights as a wedding and portrait photographer, and still yearns to be a better typist."
  },
  {
    "link": "https://www.digitaltrends.com/users/lchang/",
    "name": "Lulu Chang",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Fascinated by the effects of technology on human interaction, Lulu believes that if her parents can use your new app, service, or gadget, it\u0027s worth her attention. To help bring her mother and father into the 21st century, reach out via Twitter or email with your best products and services."
  },
  {
    "link": "https://www.digitaltrends.com/users/lesshu/",
    "name": "Les Shu",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "I am formerly a senior editor at Digital Trends. I bring with me more than a decade of tech and lifestyle journalism experience. I have written for a variety publications that include Laptop, Men\u0027s Fitness, Computer Shopper, More, Best Life, and Men\u0027s Journal. My approach to tech is simple: Highlighting the best products that are easy to use with the most bang for your buck. On the side, I am an airline nerd (I also covered travel-related articles) who enjoys building Lego sets. Find me on Twitter or Instagram."
  },
  {
    "link": "https://www.digitaltrends.com/users/gregnibler/",
    "name": "Greg Nibler",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Greg has worked as a Host, Producer, and Writer in radio and television since the early 2000s, working for such companies as CBS Radio, Alpha Broadcasting, the Portland Trail Blazers and Funemployment Radio. He feels we live in a wonderful age of technology, as it’s theoretically possible his childhood dream of owning a hoverboard, flying car and a holodeck could actually come true.."
  },
  {
    "link": "https://www.digitaltrends.com/users/bradbourque/",
    "name": "Brad Bourque",
    "workingAs": "Former Digital Trends Contributor",
    "detail": "Brad Bourque is a native Portlander, devout nerd, and craft beer enthusiast. He studied creative writing at Willamette University in Salem, Oregon before returning home to Portland. Now Brad resides in North Portland, surrounded by breweries, local music, and fellow members of the Timbers Army. Say hi to him on Twitter or Instagram, and maybe you\u0027ll run across him in a game of Heroes of the Storm."
  }
]